zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
            <parameters>
              <param name="FCW_CTRLAPRIV_IMPLEMENTED" value="1" caption="--"/>
              <param name="FCW_INTFLAGSET_IMPLEMENTED" value="1" caption="--"/>
              <param name="FCW_WPCTRL_IMPLEMENTED" value="0" caption="--"/>
              <param name="FCW_WPCTRL_KEY" value="0x464357" caption="--"/>
              <param name="FCW_PFM_ADDR_BASE" value="0x0C000000" caption="--"/>
              <param name="FCW_BFM_ADDR_BASE" value="0x08000000" caption="--"/>
              <param name="FCW_CFM_ADDR_BASE" value="0x0A000000" caption="--"/>
              <param name="FCW_VSS_CFG0_BASE" value="0x0A004000" caption="--"/>
              <param name="FCW_VSS_CFG1_BASE" value="0x0A005000" caption="--"/>
              <param name="FCW_VSS_CFG2_BASE" value="0" caption="Not applicable for QS"/>
              <param name="FCW_VSS_CFG3_BASE" value="0" caption="Not applicable for QS"/>
              <param name="FCW_VSS_CFG4_BASE" value="0" caption="Not applicable for QS"/>
              <param name="FCW_VSS_CFG5_BASE" value="0" caption="Not applicable for QS"/>
              <param name="FCW_PWP_REGIONS" value="4" caption="--"/>
              <param name="FCW_PWP_MSB" value="6" caption="--"/>
              <param name="FCW_TAMPER_PRESENT" value="1" caption="--"/>
              <param name="FCW_TAMPER_ADDR" value="0x0A003200" caption="--"/>
              <param name="FCW_TAMPER_DATA" value="0x00000000" caption="--"/>
              <param name="FCW_SD_USE_CPCNT" value="1" caption="--"/>
              <param name="FCW_NUM_DATA_SFR" value="4" caption="(PFM_DATA_MSB+1)/32"/>
              <param name="FCW_TPAR_MSB" value="3" caption="(PFM_PNL_DATA_MSB - PFM_DATA_MSB)/4"/>
              <param name="FCW_PERIOD_MIN" value="75" caption="--"/>
              <param name="FCW_PERIOD_NOM" value="116" caption="--"/>
              <param name="PFM_SIZE" value="6" caption="--"/>
              <param name="PFM_NUM_PANELS" value="1" caption="--"/>
              <param name="PFM_PNL_ADDR_MSB" value="18" caption="--"/>
              <param name="PFM_SYS_ADDR_MSB" value="18" caption="--"/>
              <param name="PFM_ROW_ADDR_MSB" value="9" caption="--"/>
              <param name="PFM_PAGE_ADDR_MSB" value="11" caption="--"/>
              <param name="PFM_PNL_DATA_MSB" value="139" caption="--"/>
              <param name="PFM_DATA_MSB" value="127" caption="--"/>
              <param name="PFM_NUM_RR" value="2" caption="--"/>
              <param name="BFM_PNL_ADDR_MSB" value="13" caption="--"/>
              <param name="BFM_SYS_ADDR_MSB" value="13" caption="--"/>
              <param name="CFM_PNL_ADDR_MSB" value="14" caption="--"/>
              <param name="CFM_SYS_ADDR_MSB" value="14" caption="--"/>
              <param name="NVR_NUM_PAGES" value="12" caption="--"/>
              <param name="PFM_TWS_NS" value="5" caption="value irrelevant, must be &gt;0"/>
              <param name="PFM_TWH_NS" value="5" caption="value irrelevant, must be &gt;0"/>
              <param name="PFM_TNVS_NS" value="4000" caption="See Note 2"/>
              <param name="PFM_TPROG_NS" value="18000" caption="See Note 3"/>
              <param name="PFM_TPREPROG_NS" value="3000" caption="See Note 3"/>
              <param name="PFM_TADS_NS" value="15" caption="See Note 2"/>
              <param name="PFM_TADH_NS" value="15" caption="See Note 2"/>
              <param name="PFM_TPGS_NS" value="8000" caption="See Note 2"/>
              <param name="PFM_TPREPGH_NS" value="15" caption="See Note 2"/>
              <param name="PFM_TPREPGS_NS" value="1000" caption="See Note 2"/>
              <param name="PFM_TPGH_NS" value="15" caption="See Note 2"/>
              <param name="PFM_TRCV_PROG_NS" value="5000" caption="See Note 2"/>
              <param name="PFM_TRCV_ERASE_NS" value="50000" caption="See Note 2"/>
              <param name="PFM_TERASE_NS" value="18000000" caption="See Note 3"/>
              <param name="PFM_TERASE_RETRY_NS" value="4500000" caption="See Note 3"/>
              <param name="PFM_TSCE_NS" value="18000000" caption="See Note 3"/>
              <param name="PFM_TRW_NS" value="100" caption="See Note 2"/>
              <param name="PFM_TPUMPENS" value="1000" caption="See Note 2"/>
              <param name="PFM_TPUMPENH" value="100" caption="See Note 2"/>
              <param name="PFM_TPUMP_CYCLES" value="1029" caption="See Note 2"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="2" caption="H2PB Peripheral ID"/>
              <param name="FLASH_SIZE" value="524288"/>
              <param name="INSTANCE_ID" value="2" caption="Instance index for FCW"/>
              <param name="MCLK_ID_AHB" value="2" caption="Index for FCW AHB clock"/>
              <param name="PAC_ID" value="2" caption="Index for FCW registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FPB" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPB">
            <register-group name="FPB" name-in-module="FPB" address-space="base" offset="0xE0002000"/>
            <parameters>
              <param name="__BKPT_NUM" value="4" caption="Number of FPB breakpoint comparators"/>
            </parameters>
          </instance>
        </module>
        <module name="FREQM" id="03707" name2="clk_freqm_u2257_v3" version="3a0">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x4400C000"/>
            <parameters>
              <param name="MSRCLK_NB" value="2" caption="Number of measured clock sources"/>
              <param name="GCLK_ID_MSR0" value="2"/>
              <param name="GCLK_ID_MSR1" value="3"/>
              <param name="GCLK_ID_REF" value="4"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="6" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="10" caption="Instance index for FREQM"/>
              <param name="MCLK_ID_APB" value="10" caption="Index for FREQM APB clock"/>
              <param name="PAC_ID" value="10" caption="Index for FREQM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="fuses" name2="fuses" version="1a0">
          <instance name="FUSES">
            <register-group name="FUSES_ROMCFG" name-in-module="FUSES_ROMCFG" address-space="base" offset="0x0A003000"/>
