zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
<register-group name="FUSES_BOOTCFG1" name-in-module="FUSES_BOOTCFG1" address-space="base" offset="0x0A002000"/>
<register-group name="FUSES_BOOTCFG1A" name-in-module="FUSES_BOOTCFG1" address-space="base" offset="0x0A000000"/>
            <register-group name="FUSES_CALOTP" name-in-module="FUSES_CALOTP" address-space="base" offset="0x0A007000"/>
          </instance>
        </module>
        <module name="GCLK" id="03588" name2="clk_gclk_u2122_v1" version="1d0">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x44008000"/>
            <signals>
              <signal group="IO" index="0" function="K" pad="PB06"/>
              <signal group="IO" index="0" function="K" pad="PD05"/>
              <signal group="IO" index="1" function="K" pad="PC00"/>
              <signal group="IO" index="1" function="K" pad="PC05"/>
              <signal group="IO" index="1" function="K" pad="PD04"/>
              <signal group="IO" index="2" function="K" pad="PC01"/>
              <signal group="IO" index="3" function="K" pad="PC02"/>
              <signal group="IO" index="4" function="K" pad="PC03"/>
              <signal group="IO" index="5" function="K" pad="PC04"/>
              <signal group="TST_GCLK" function="DSU_TEST_GCLK" pad="PC08"/>
            </signals>
            <parameters>
              <param name="GEN_NUM" value="12" caption="--"/>
              <param name="IO_NUM" value="8" caption="derived, # of &quot;1&quot; in GCLK_GEN_IO_EXIST"/>
              <param name="MUXED_NUM" value="39" caption="Number of GCLK channels"/>
              <param name="SOURCE_NUM" value="11" caption="--"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="4" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="8" caption="Instance index for GCLK"/>
              <param name="MCLK_ID_APB" value="8" caption="Index for GCLK APB clock"/>
              <param name="PAC_ID" value="8" caption="Index for GCLK registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="H2PB" id="04947" name2="bus_ahb2apb_v1" version="1a0">
          <instance name="H2PB0">
            <register-group name="H2PB0" name-in-module="H2PB" address-space="base" offset="0x44032000"/>
            <parameters>
              <param name="H2PB_MST_N" value="2" caption="--"/>
              <param name="H2PB_MST_MAX" value="1" caption="derived parameter"/>
              <param name="H2PB_SLV_N" value="32" caption="--"/>
              <param name="H2PB_SLV_MAX" value="31" caption="derived parameter"/>
              <param name="H2PB_PADDR_IDXB" value="5" caption="derived parameter"/>
              <param name="H2PB_PADDR_LSB" value="13" caption="--"/>
              <param name="H2PB_WPCTRL_IMPLEMENTED" value="0" caption="--"/>
              <param name="H2PB_PAGE_SIZE" value="8192" caption="derived parameter"/>
              <param name="H2PB_OWN_SFR_SLOT" value="25" caption="--"/>
              <param name="H2PB_PADDR_SIZE" value="18" caption="local parameter"/>
              <param name="H2PB_PADDR_MSB" value="17" caption="derived local parameter"/>
              <param name="H2PB_BASE_MSB" value="13" caption="derived parameter"/>
              <param name="H2PB_USE_HSEL" value="1" caption="--"/>
              <param name="H2PB_USE_DPATH_PIPER" value="0" caption="1=&quot;all pipelined&quot;0=&quot;address pipelined&quot;"/>
              <param name="H2PB_USE_EARLY_PREAD" value="0" caption="--"/>
              <param name="H2PB_CLK_DIV_EN" value="0" caption="1=&quot;n:1 clock&quot;0=&quot;1:1 clock&quot;"/>
              <param name="H2PB_USE_PSTRB_FOR_READS" value="1" caption="--"/>
              <param name="H2PB_WPCTRL_KEY" value="0x504230" caption="--"/>
              <param name="H2PB_NONSEC_INIT_VAL" value="0x00000001" caption="--"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="25" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="19" caption="Instance index for H2PB0"/>
              <param name="MCLK_ID_AHB" value="25" caption="Index for H2PB0 AHB clock"/>
              <param name="MCLK_ID_APB" value="26" caption="Index for H2PB0 APB clock"/>
              <param name="PAC_ID" value="19" caption="Index for H2PB0 registers write protection"/>
            </parameters>
          </instance>
          <instance name="H2PB1">
            <register-group name="H2PB1" name-in-module="H2PB" address-space="base" offset="0x44838000"/>
            <parameters>
              <param name="H2PB_MST_N" value="2" caption="--"/>
              <param name="H2PB_MST_MAX" value="1" caption="derived parameter"/>
              <param name="H2PB_SLV_N" value="32" caption="--"/>
              <param name="H2PB_SLV_MAX" value="31" caption="derived parameter"/>
              <param name="H2PB_PADDR_IDXB" value="5" caption="derived parameter"/>
              <param name="H2PB_PADDR_LSB" value="13" caption="--"/>
              <param name="H2PB_WPCTRL_IMPLEMENTED" value="0" caption="--"/>
              <param name="H2PB_PAGE_SIZE" value="8192" caption="derived parameter"/>
              <param name="H2PB_OWN_SFR_SLOT" value="28" caption="--"/>
              <param name="H2PB_PADDR_SIZE" value="18" caption="local parameter"/>
              <param name="H2PB_PADDR_MSB" value="17" caption="derived local parameter"/>
              <param name="H2PB_BASE_MSB" value="13" caption="derived parameter"/>
              <param name="H2PB_USE_HSEL" value="1" caption="--"/>
              <param name="H2PB_USE_DPATH_PIPER" value="0" caption="1=&quot;all pipelined&quot;0=&quot;address pipelined&quot;"/>
              <param name="H2PB_USE_EARLY_PREAD" value="0" caption="--"/>
              <param name="H2PB_CLK_DIV_EN" value="0" caption="1=&quot;n:1 clock&quot;0=&quot;1:1 clock&quot;"/>
              <param name="H2PB_USE_PSTRB_FOR_READS" value="1" caption="--"/>
              <param name="H2PB_WPCTRL_KEY" value="0x504231" caption="--"/>
              <param name="H2PB_NONSEC_INIT_VAL" value="0x00000000" caption="--"/>
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="28" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="46" caption="Instance index for H2PB1"/>
              <param name="MCLK_ID_AHB" value="57" caption="Index for H2PB1 AHB clock"/>
              <param name="MCLK_ID_APB" value="58" caption="Index for H2PB1 APB clock"/>
              <param name="PAC_ID" value="46" caption="Index for H2PB1 registers write protection"/>
            </parameters>
          </instance>
          <instance name="H2PB2">
            <register-group name="H2PB2" name-in-module="H2PB" address-space="base" offset="0x4500E000"/>
            <parameters>
              <param name="H2PB_MST_N" value="1" caption="--"/>
              <param name="H2PB_MST_MAX" value="0" caption="derived parameter"/>
              <param name="H2PB_SLV_N" value="8" caption="--"/>
              <param name="H2PB_SLV_MAX" value="7" caption="derived parameter"/>
              <param name="H2PB_PADDR_IDXB" value="3" caption="derived parameter"/>
              <param name="H2PB_PADDR_LSB" value="13" caption="--"/>
              <param name="H2PB_WPCTRL_IMPLEMENTED" value="0" caption="--"/>
              <param name="H2PB_PAGE_SIZE" value="8192" caption="derived parameter"/>
              <param name="H2PB_OWN_SFR_SLOT" value="7" caption="--"/>
              <param name="H2PB_PADDR_SIZE" value="16" caption="local parameter"/>
              <param name="H2PB_PADDR_MSB" value="15" caption="derived local parameter"/>
              <param name="H2PB_BASE_MSB" value="15" caption="derived parameter"/>
              <param name="H2PB_USE_HSEL" value="1" caption="--"/>
              <param name="H2PB_USE_DPATH_PIPER" value="1" caption="1=&quot;all pipelined&quot;0=&quot;address pipelined&quot;"/>
              <param name="H2PB_USE_EARLY_PREAD" value="0" caption="--"/>
              <param name="H2PB_CLK_DIV_EN" value="1" caption="1=&quot;n:1 clock&quot;0=&quot;1:1 clock&quot;"/>
              <param name="H2PB_USE_PSTRB_FOR_READS" value="1" caption="--"/>
              <param name="H2PB_WPCTRL_KEY" value="0x504232" caption="--"/>
              <param name="H2PB_NONSEC_INIT_VAL" value="0x00" caption="--"/>
              <param name="BRIDGE_ID" value="2" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="7" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="47" caption="Instance index for H2PB2"/>
              <param name="MCLK_ID_AHB" value="59" caption="Index for H2PB2 AHB clock"/>
              <param name="MCLK_ID_APB" value="60" caption="Index for H2PB2 APB clock"/>
              <param name="PAC_ID" value="47" caption="Index for H2PB2 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="HMATRIX2" id="bus_hmatrix2_v5" name2="bus_hmatrix2_v5" version="5f0">
          <instance name="HMATRIX2">
            <register-group name="HMATRIX2" name-in-module="HMATRIX2" address-space="base" offset="0x44010000"/>
            <parameters>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="8" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="22" caption="Instance index for HMATRIX2"/>
              <param name="MCLK_ID_AHB" value="30" caption="Index for HMATRIX2 AHB clock"/>
              <param name="MCLK_ID_APB" value="31" caption="Index for HMATRIX2 APB clock"/>
              <param name="PAC_ID" value="22" caption="Index for HMATRIX2 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="ICB" id="SYSTEM_IP" version="1.0.0">
          <instance name="ICB">
            <register-group name="ICB" name-in-module="ICB" address-space="base" offset="0xE000E000"/>
