zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
          </instance>
        </module>
        <module name="MCLK" id="04158" name2="clk_mclk_v1" version="1a0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x4400A000"/>
            <parameters>
              <param name="MCLK_SYNC_EDGES" value="1" caption="--"/>
              <param name="MCLK_DIV_CLK_NUM" value="3" caption="one for all other, one for H2PB2 domain, one for MBISTINTF"/>
              <param name="MCLK_CKDIV_REGS_BITS" value="8" caption="--"/>
              <param name="MCLK_CKDIV_RESET_VALUE" value="0x1 0x2 0x4 0x1 0x1 0x1 0x1 0x1 0x1 0x1 0x1 0x1" caption="values must be binary divisor numberunused divisors must be 8'h1"/>
              <param name="MCLK_CKDIV_WRLOCK" value="0x00000000" caption="--"/>
              <param name="MCLK_CPU_CLK_DIVIDER" value="0" caption="--"/>
              <param name="MCLK_CPU_CLK_IDLE" value="0" caption="--"/>
              <param name="MCLK_CPU_CLK_OFFDLY" value="2" caption="--"/>
              <param name="MCLK_CPU_CLK_ONDLY" value="0" caption="--"/>
              <param name="MCLK_SYS_CLK_DIVIDER" value="0" caption="--"/>
              <param name="MCLK_SYS_CLK_OFFDLY" value="2" caption="--"/>
              <param name="MCLK_CLKMSK_NUM" value="65" caption="--"/>
              <param name="MCLK_CKPER_IMPLEMENTED" value="0xFFFFFFFF 0xFFFFFFFF 0x00000001 0x00000000 0x00000000 0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="MCLK_CKPER_RSTVAL" value="0xFFEEFFFF 0xFFFFFFFF 0x00000001 0x00000000 0x00000000 0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="MCLK_CKPER_DIVIDER" value="0 0 0 1 1 1 0 1 0 0 0 0 1 0 0 1 0 0 0 2 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0" caption="--"/>
              <param name="MCLK_CKPER_REQEXISTS" value="0xD9FFFFFF 0xE1FFFFFF 0x00000001 0x00000000 0x00000000 0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="MCLK_CKPER_MASTER" value="0x11800004 0x40400000 0x00000000 0x00000000 0x00000000 0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="MCLK_CKPER_WILLRISE" value="0x00080000 0x10000000 0x00000000 0x00000000 0x00000000 0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="JTAG_IMPLEMENTED" value="1" caption="--"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="5" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="9" caption="Instance index for MCLK"/>
              <param name="MCLK_ID_APB" value="9" caption="Index for MCLK APB clock"/>
              <param name="PAC_ID" value="9" caption="Index for MCLK registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="MCRAMC" id="04921" name2="drm_mcramc_v5" version="5b0">
          <instance name="MCRAMC">
            <register-group name="MCRAMC" name-in-module="MCRAMC" address-space="base" offset="0x4402C000"/>
            <parameters>
              <param name="AHB_CLOCK_ENABLE" value="0" caption="--"/>
              <param name="AHB_ECC" value="1" caption="--"/>
              <param name="AHB_PORTS_NB" value="8" caption="--"/>
              <param name="AHB_READ_PREBUFFERING" value="0" caption="--"/>
              <param name="AHB_REQUEST_ISOLATION_REGISTER" value="0" caption="--"/>
              <param name="ARBITRATION_TYPE" value="2" caption="Parameter should be &quot;ENUM_HOPSCOTCH&quot;Fix for text parameter in ConstellationCONST_DEV-1173"/>
              <param name="BIT_STROBE_RAM" value="0" caption="parameter n/a if STORE_BYTE_STROBE=0"/>
              <param name="CHANNELS_NB" value="2" caption="--"/>
              <param name="ECC_SYNDROM_REGISTER" value="0" caption="--"/>
              <param name="HADDR_READ_ISOLATION_REGISTER" value="0" caption="--"/>
              <param name="HRDATA_ISOLATION_CONFIGURABLE" value="1" caption="--"/>
              <param name="HRDATA_ISOLATION_DEFAULT" value="0" caption="default to 0 wait states"/>
              <param name="MCRAMC_CLK_GATER" value="0" caption="--"/>
              <param name="MCRAMC_PADDR_SIZE" value="13" caption="--"/>
              <param name="MEMORY_AUTO_CORRECTION" value="1" caption="--"/>
              <param name="MEMORY_ENABLE_POLARITY" value="0" caption="--"/>
              <param name="MW_CLOCK_ENABLE" value="0" caption="--"/>
              <param name="MW_DATA_SIZE" value="32" caption="--"/>
              <param name="MW_PORT_SLICES_NB" value="0" caption="--"/>
              <param name="M0_CLOCK_ENABLE" value="0" caption="--"/>
              <param name="M0_DATA_SIZE" value="32" caption="--"/>
              <param name="M0_HYBRID_READ_WRITE_ACCESS" value="0" caption="--"/>
              <param name="M0_PORT_SLICES_NB" value="0" caption="--"/>
              <param name="PRIVILEGED_BIT_CHECK" value="1" caption="--"/>
              <param name="RAM_ADD_SIZE" value="14" caption="--"/>
              <param name="RAM_AHB_ADDRESS_OFFSET" value="0" caption="--"/>
              <param name="RAM_ERASE" value="0" caption="--"/>
              <param name="STORE_BYTE_STROBE" value="0" caption="--"/>
              <param name="ULTRA" value="1" caption="--"/>
              <param name="WP_KEY" value="0x465852" caption="&quot;FXR&quot;"/>
              <param name="WRITE_ENABLE_POLARITY" value="0" caption="--"/>
              <param name="WRITE_ENABLE_USED" value="1" caption="--"/>
              <param name="WRITE_MASK_POLARITY" value="0" caption="--"/>
              <param name="WRITE_PROTECT_REGISTER" value="0" caption="--"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="22" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="16" caption="Instance index for MCRAMC"/>
              <param name="MCLK_ID_APB" value="21" caption="Index for MCRAMC APB clock"/>
              <param name="MCLK_ID_AHB" value="22" caption="Index for MCRAMC AHB clock"/>
              <param name="PAC_ID" value="16" caption="Index for MCRAMC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="MPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
            <parameters>
              <param name="__MPU_REGIONS" value="8" caption="Number of MPU regions"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" id="SYSTEM_IP" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="141" caption="Number of interrupt request lines"/>
            </parameters>
          </instance>
        </module>
