zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
        <module name="OSC32KCTRL" id="03717" name2="osc_osc32kctrl_u2400_v2" version="2a0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x45008000"/>
            <signals>
              <signal group="CLKIN32" index="32" function="XOSC32K_XIN32_AMODE" pad="PB01"/>
              <signal group="XIN32" index="32" function="XOSC32K_XIN32" pad="PB01"/>
              <signal group="XOUT32" index="32" function="XOSC32K_XOUT32" pad="PB02"/>
            </signals>
            <parameters>
              <param name="BRIDGE_ID" value="2" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="4" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="7" caption="Instance index for OSC32KCTRL"/>
              <param name="MCLK_ID_APB" value="7" caption="Index for OSC32KCTRL APB clock"/>
              <param name="PAC_ID" value="7" caption="Index for OSC32KCTRL registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="OSCCTRL" id="03718" name2="osc_oscctrl_u2401_v2" version="2b0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x44006000"/>
            <signals>
              <signal group="CLKIN" function="XOSC_XIN_AMODE" pad="PD05"/>
              <signal group="XIN" function="XOSC_XIN" pad="PD05"/>
              <signal group="XOUT" function="XOSC_XOUT" pad="PD04"/>
            </signals>
            <parameters>
              <param name="DFLL48M_ATEST_IMPLEMENTED" value="1" caption="--"/>
              <param name="DFLL48M_ATEST_SIZE" value="8" caption="--"/>
              <param name="DFLL48M_IS_STARTUP_OSCILLATOR" value="1" caption="--"/>
              <param name="DFLL48M_RC48MCAL0_PORVAL" value="0x00000000" caption="--"/>
              <param name="DIV_8MHZ_NUM" value="2" caption="--"/>
              <param name="FRACDIVS_NUM" value="0" caption="--"/>
              <param name="FRACDIV_DIVIDER_RESET_VAL" value="0" caption="--"/>
              <param name="FRACDIV_PLLSRC" value="0" caption="--"/>
              <param name="PLLS_NUM" value="1" caption="--"/>
              <param name="PLL0_OUTPUTS_NUM" value="5" caption="--"/>
              <param name="PLL1_OUTPUTS_NUM" value="0" caption="--"/>
              <param name="USBHS_NUM" value="1" caption="should be 0, but IP has bug"/>
              <param name="XOSC_ATEST_IMPLEMENTED" value="1" caption="--"/>
              <param name="XOSC_ATEST_SIZE" value="4" caption="--"/>
              <param name="XOSC_CFD_CLK_SELECT_SIZE" value="4" caption="--"/>
              <param name="XOSC_CFD_HAS_RETENTION" value="0" caption="--"/>
              <param name="GCLK_ID_DFLL48M" value="0"/>
              <param name="GCLK_ID_PLL" value="1"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="3" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="6" caption="Instance index for OSCCTRL"/>
              <param name="MCLK_ID_APB" value="6" caption="Index for OSCCTRL APB clock"/>
              <param name="PAC_ID" value="6" caption="Index for OSCCTRL registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="04298" name2="sec_pac_apb_v1" version="1a0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x44022000"/>
            <parameters>
              <param name="PAC_PER_WRPROT_MASK" value="0xFFFFFFFF 0x0003FFFF 0x00000000 0x00000000" caption="Peripheral implemented mask. If PAC_PER_WRPROT_MASK[x]=1 then the PAC implements an SFR bit in INTFLAG, STATUS, and LOCK with the location of &lt;REG&gt;(x/32)[x mod 32]"/>
              <param name="PAC_STATUS_RESET_VALUE" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="WRP STATUS Reset Value for Peripherals. On reset STATUS(x/32)[x mod 32]=PAC_STATUS_RESET_VALUE[x]The reset value for each peripheral should always be 0. The parameter exists if there is an unforeseen circumstance requiring it to be 1. Test blocks are not one of them as they are protected by dsu_test_mode."/>
              <param name="PAC_LOCK_RESET_VALUE" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="PAC_ERRORS_INBAND" value="1" caption="--"/>
              <param name="PAC_CTRLAPRIV_IMPLEMENTED" value="1" caption="--"/>
              <param name="PAC_INTFLAGSET_IMPLEMENTED" value="0" caption="--"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="17" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="14" caption="Instance index for PAC"/>
              <param name="MCLK_ID_APB" value="14" caption="Index for PAC APB clock"/>
              <param name="PAC_ID" value="14" caption="Index for PAC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="PDM" id="test_pdm_v1" name2="test_pdm_v1" version="1.0.0">
          <instance name="PDM">
            <signals>
              <signal group="PDMDIS" function="TST_DIG" pad="PDMDIS"/>
              <signal group="PDMI" index="0" function="PDMI_TEST" pad="PD07"/>
              <signal group="PDMI" index="1" function="PDMI_TEST" pad="PD08"/>
              <signal group="PDMI" index="2" function="PDMI_TEST" pad="PD09"/>
              <signal group="PDMI" index="3" function="PDMI_TEST" pad="PA00"/>
              <signal group="PDMO" index="0" function="PDMO_LV_TEST" pad="PB03"/>
              <signal group="PDMO" index="1" function="PDMO_LV_TEST" pad="PB04"/>
              <signal group="PDMO" index="2" function="PDMO_LV_TEST" pad="PB05"/>
              <signal group="PDMO" index="3" function="PDMO_LV_TEST" pad="PB06"/>
              <signal group="PDMO" index="4" function="PDMO_LV_TEST" pad="PC00"/>
              <signal group="PDMO" index="5" function="PDMO_LV_TEST" pad="PC01"/>
              <signal group="PDMO" index="6" function="PDMO_LV_TEST" pad="PC02"/>
              <signal group="PDMO" index="7" function="PDMO_LV_TEST" pad="PC03"/>
              <signal group="PDMO0_MV" function="PDMO_MV_TEST" pad="PB03"/>
              <signal group="PDMO1_MV" function="PDMO_MV_TEST" pad="PB04"/>
              <signal group="PDMO2_MV" function="PDMO_MV_TEST" pad="PB05"/>
              <signal group="PDMO3_MV" function="PDMO_MV_TEST" pad="PB06"/>
              <signal group="PDMO4_MV" function="PDMO_MV_TEST" pad="PC00"/>
              <signal group="PDMO5_MV" function="PDMO_MV_TEST" pad="PC01"/>
              <signal group="PDMO6_MV" function="PDMO_MV_TEST" pad="PC02"/>
              <signal group="PDMO7_MV" function="PDMO_MV_TEST" pad="PC03"/>
            </signals>
          </instance>
        </module>
        <module name="PM" id="03926" name2="pwr_rpmu_pm_v1" version="1c0">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x45000000"/>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="1" caption="--"/>
              <param name="PD_NUM" value="1" caption="Number of Switchable Power Domains2 total domains (PD_CORE_SW and PD_CORE_BU)"/>
              <param name="BRIDGE_ID" value="2" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="0" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="3" caption="Instance index for PM"/>
              <param name="MCLK_ID_APB" value="3" caption="Index for PM APB clock"/>
              <param name="PAC_ID" value="3" caption="Index for PM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="PORT" id="03720" name2="gpio_port_u2210_v4" version="4a0">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x44800000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="32" function="default" pad="PB00"/>
              <signal group="P" index="33" function="default" pad="PB01"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="36" function="default" pad="PB04"/>
              <signal group="P" index="37" function="default" pad="PB05"/>
              <signal group="P" index="38" function="default" pad="PB06"/>
              <signal group="P" index="64" function="default" pad="PC00"/>
              <signal group="P" index="65" function="default" pad="PC01"/>
              <signal group="P" index="66" function="default" pad="PC02"/>
              <signal group="P" index="67" function="default" pad="PC03"/>
              <signal group="P" index="68" function="default" pad="PC04"/>
              <signal group="P" index="69" function="default" pad="PC05"/>
              <signal group="P" index="70" function="default" pad="PC06"/>
              <signal group="P" index="71" function="default" pad="PC07"/>
              <signal group="P" index="72" function="default" pad="PC08"/>
              <signal group="P" index="96" function="default" pad="PD00"/>
              <signal group="P" index="97" function="default" pad="PD01"/>
              <signal group="P" index="98" function="default" pad="PD02"/>
              <signal group="P" index="99" function="default" pad="PD03"/>
              <signal group="P" index="100" function="default" pad="PD04"/>
              <signal group="P" index="101" function="default" pad="PD05"/>
              <signal group="P" index="102" function="default" pad="PD06"/>
              <signal group="P" index="103" function="default" pad="PD07"/>
              <signal group="P" index="104" function="default" pad="PD08"/>
              <signal group="P" index="105" function="default" pad="PD09"/>
            </signals>
            <parameters>
              <param name="AHB_IMPLEMENTED" value="0" caption="No AHB bus"/>
              <param name="BITS" value="117" caption="--"/>
              <param name="DIR_DEFAULT_VAL" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="DIR_IMPLEMENTED" value="0x001FFFFF 0x0003FFFF 0x000FFFFF 0x001FFFFF" caption="DIR RegistersImplemented"/>
              <param name="DRVSTR" value="0" caption="No DRVSTR bits"/>
              <param name="DRVSTR_DEFAULT_VAL" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="DRVSTR_IMPLEMENTED" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="PINCFG.DRVSTR0RegistersImplemented"/>
              <param name="DRVSTR1_DEFAULT_VAL" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="DRVSTR1_IMPLEMENTED" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="PINCFG.DRVSTR1RegistersImplemented"/>
              <param name="EVENT_IMPLEMENTED" value="0x001FFFFF 0x0003FFFF 0x000FFFFF 0x001FFFFF" caption="Event RegistersImplemented"/>
              <param name="EV_NUM" value="4" caption="--"/>
              <param name="GROUPS" value="4" caption="--"/>
              <param name="HADDR_MSB" value="31" caption="--"/>
              <param name="INEN_DEFAULT_VAL" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="INEN_IMPLEMENTED" value="0x001FFFFF 0x0003FFFF 0x000FFFFF 0x001FFFFF" caption="PINCFG.INENRegistersImplemented"/>
              <param name="IOBUS_IMPLEMENTED" value="0" caption="No IOBUS"/>
              <param name="MSB" value="116" caption="PORT_BITS-1"/>
              <param name="NONSEC_DEFAULT_VAL" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="NONSEC_IMPLEMENTED" value="0x001FFFFF 0x0003FFFF 0x000FFFFF 0x001FFFFF" caption="NONSECRegistersImplemented"/>
              <param name="ODRAIN" value="1" caption="--"/>
              <param name="ODRAIN_DEFAULT_VAL" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="ODRAIN_IMPLEMENTED" value="0x001FFFFF 0x0003FFFF 0x000FFFFF 0x001FFFFF" caption="PINCFG.ODRAINRegistersImplemented"/>
              <param name="OUT_DEFAULT_VAL" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="OUT_IMPLEMENTED" value="0x001FFFFF 0x0003FFFF 0x000FFFFF 0x001FFFFF" caption="OUT RegistersImplemented"/>
              <param name="PIN_IMPLEMENTED" value="0x001FFFFF 0x0003FFFF 0x000FFFFF 0x001FFFFF" caption="Port PinsImplemented"/>
              <param name="PMUXBIT0_DEFAULT_VAL" value="0x00000000 0x00000000 0x00000000 0x0000000C" caption="--"/>
              <param name="PMUXBIT0_IMPLEMENTED" value="0x001FFFFF 0x0003FFF9 0x000FFE7F 0x001FFFC3" caption="Bit 0 of PMUX field"/>
              <param name="PMUXBIT1_DEFAULT_VAL" value="0x00000000 0x00000000 0x000001E0 0x0000000C" caption="--"/>
              <param name="PMUXBIT1_IMPLEMENTED" value="0x0007FFFF 0x000387F9 0x000FFE7F 0x001FFFF3" caption="Bit 1 of PMUX field"/>
              <param name="PMUXBIT2_DEFAULT_VAL" value="0x00000000 0x00000000 0x000001E0 0x0000000C" caption="--"/>
              <param name="PMUXBIT2_IMPLEMENTED" value="0x001BFFFF 0x00007FF9 0x0000067F 0x00003FC3" caption="Bit 2 of PMUX field"/>
              <param name="PMUXBIT3_DEFAULT_VAL" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="PMUXBIT3_IMPLEMENTED" value="0x001FFFFF 0x0003FFF9 0x000BFE7F 0x001FDFF3" caption="Bit 3 of PMUX field"/>
              <param name="PMUXEN_DEFAULT_VAL" value="0x00000000 0x00000000 0x000001E0 0x00000000" caption="--"/>
              <param name="PMUXEN_IMPLEMENTED" value="0x001FFFFF 0x0003FFFF 0x000FFFFF 0x001FFFFF" caption="PINCFG.PMUXEN bit"/>
              <param name="PPP_IMPLEMENTED" value="0" caption="No IOBUS2"/>
              <param name="PULLEN_DEFAULT_VAL" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="PULLEN_IMPLEMENTED" value="0x001FFFFF 0x0003FFFF 0x000FFFFF 0x001FFFFF" caption="PINCFG.PULLENRegistersImplemented"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Mixed Secure Enabled"/>
              <param name="SLEWLIM" value="2" caption="Number of SLEWLIM bit"/>
              <param name="SLEWLIM_DEFAULT_VAL" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="SLEWLIM_IMPLEMENTED" value="0x0007C07F 0x00038078 0x000FF87F 0x001FCFC3" caption="PINCFG.SLEWLIM0RegistersImplemented"/>
              <param name="SLEWLIM1_DEFAULT_VAL" value="0x00000000 0x00000000 0x00000000 0x00000000" caption="--"/>
              <param name="SLEWLIM1_IMPLEMENTED" value="0x0007C07F 0x00038078 0x000FF87F 0x001FCFC3" caption="PINCFG.SLEWLIM1RegistersImplemented"/>
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="0" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="20" caption="Instance index for PORT"/>
              <param name="MCLK_ID_APB" value="27" caption="Index for PORT APB clock"/>
              <param name="PAC_ID" value="20" caption="Index for PORT registers write protection"/>
            </parameters>
          </instance>
        </module>
