zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
        <module name="PTC" id="04743" name2="afe_ptc_ctrl_apb_plrs_v1" version="1a0">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x4482C000"/>
            <signals>
              <signal group="PTCXY" index="0" function="P" pad="PD06"/>
              <signal group="PTCXY" index="1" function="P" pad="PD07"/>
              <signal group="PTCXY" index="2" function="P" pad="PD08"/>
              <signal group="PTCXY" index="3" function="P" pad="PD09"/>
              <signal group="PTCXY" index="4" function="P" pad="PA00"/>
              <signal group="PTCXY" index="5" function="P" pad="PA01"/>
              <signal group="PTCXY" index="6" function="P" pad="PA02"/>
              <signal group="PTCXY" index="7" function="P" pad="PA03"/>
              <signal group="PTCXY" index="8" function="P" pad="PA04"/>
              <signal group="PTCXY" index="9" function="P" pad="PA05"/>
              <signal group="PTCXY" index="10" function="P" pad="PA06"/>
              <signal group="PTCXY" index="11" function="P" pad="PA07"/>
              <signal group="PTCXY" index="12" function="P" pad="PA08"/>
              <signal group="PTCXY" index="13" function="P" pad="PA09"/>
              <signal group="PTCXY" index="14" function="P" pad="PB00"/>
              <signal group="PTCXY" index="15" function="P" pad="PB03"/>
              <signal group="PTCXY" index="16" function="P" pad="PB04"/>
              <signal group="PTCXY" index="17" function="P" pad="PB05"/>
              <signal group="PTCXY" index="18" function="P" pad="PB06"/>
              <signal group="PTCXY" index="19" function="P" pad="PC00"/>
              <signal group="PTCXY" index="20" function="P" pad="PC01"/>
              <signal group="PTCXY" index="21" function="P" pad="PC02"/>
              <signal group="DRV" index="0" function="P" pad="PD06"/>
              <signal group="DRV" index="1" function="P" pad="PD07"/>
              <signal group="DRV" index="2" function="P" pad="PD08"/>
              <signal group="DRV" index="3" function="P" pad="PD09"/>
              <signal group="DRV" index="4" function="P" pad="PA00"/>
              <signal group="DRV" index="5" function="P" pad="PA01"/>
              <signal group="DRV" index="6" function="P" pad="PA02"/>
              <signal group="DRV" index="7" function="P" pad="PA03"/>
              <signal group="DRV" index="8" function="P" pad="PA04"/>
              <signal group="DRV" index="9" function="P" pad="PA05"/>
              <signal group="DRV" index="10" function="P" pad="PA06"/>
              <signal group="DRV" index="11" function="P" pad="PA07"/>
              <signal group="DRV" index="12" function="P" pad="PA08"/>
              <signal group="DRV" index="13" function="P" pad="PA09"/>
              <signal group="DRV" index="14" function="P" pad="PB00"/>
              <signal group="DRV" index="15" function="P" pad="PB03"/>
              <signal group="DRV" index="16" function="P" pad="PB04"/>
              <signal group="DRV" index="17" function="P" pad="PB05"/>
              <signal group="DRV" index="18" function="P" pad="PB06"/>
              <signal group="DRV" index="19" function="P" pad="PC00"/>
              <signal group="DRV" index="20" function="P" pad="PC01"/>
              <signal group="DRV" index="21" function="P" pad="PC02"/>
              <signal group="ECI" index="0" function="P" pad="PC03"/>
              <signal group="ECI" index="1" function="P" pad="PC04"/>
            </signals>
            <parameters>
              <param name="PTC_PDATA_MSB" value="31" caption="APB Data Bus Size MSB"/>
              <param name="PTC_PADDR_MSB" value="12" caption="APB Address Bus Size MSB"/>
              <param name="PTC_PADDR_SIZE" value="13" caption="Number of bits of the paddr input busPossible Values = PTC_PADDR_MSB -1"/>
              <param name="PTC_LINES_NUM" value="36" caption="Number of PTC lines desired (0 to 64)"/>
              <param name="PTC_CAL_IMPLEMENTED" value="1" caption="Defines if the CALIB register is implemented (1 = implemented)"/>
              <param name="PTC_CAL_SIZE" value="16" caption="Defines Bitfield size for CALIB register"/>
              <param name="PTC_CAL_PORVAL" value="0x00000000" caption="Defines the CALIB register reset value after POR0x00000000 to 0xFFFFFFFF"/>
              <param name="PTC_ATEST_IMPLEMENTED" value="1" caption="Defines if the ATEST register is implemented (1 = implemented)"/>
              <param name="PTC_ATEST_SIZE" value="8" caption="Defines the number of effective bits in ATEST register"/>
              <param name="PTC_WPCTRL_IMPLEMENTED" value="0" caption="Implement the WPCTRL register for write protection.0 = Use apb_ptc_wrprot to control write protection enable/disable1 = Use WPCTRL register to control write protection enable/disable."/>
              <param name="PTC_PRIV_IMPLEMENTED" value="1" caption="Implement the PRIV register for privilege/non-privilege bus accesses.0 = Register not present1 = Register present"/>
              <param name="PTC_WPCTRL_KEY" value="0x505443" caption="WPCTRL 24-bit key value. See register description for usage.Set to a unique value for each macro."/>
              <param name="GCLK_ID" value="35"/>
              <param name="DMAC_ID_EOC" value="38"/>
              <param name="DMAC_ID_SEQ" value="39"/>
              <param name="DMAC_ID_WCOMP" value="40"/>
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="22" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="41" caption="Instance index for PTC"/>
              <param name="MCLK_ID_APB" value="51" caption="Index for PTC APB clock"/>
              <param name="PAC_ID" value="41" caption="Index for PTC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="03926" name2="pwr_rpmu_rstc_v1" version="1c0">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x45004000"/>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="1"/>
              <param name="CM_DBGRESET_STRETCHED" value="3" caption="Reset stretcher size for Cortex CPU related to DBGRESET."/>
              <param name="CM_HRESET_N_STRETCHED" value="3" caption="Reset stretcher size for Cortex CPU related to HRESETn."/>
              <param name="CM_PORESET_STRETCHED" value="3" caption="Reset stretcher size for Cortex CPU related to PORESET."/>
              <param name="HIB_IMPLEMENTED" value="1"/>
              <param name="VBAT_IMPLEMENTED" value="0" caption="One if VBAT (Battery backup mode) is supported"/>
              <param name="BRIDGE_ID" value="2" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="2" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="5" caption="Instance index for RSTC"/>
              <param name="MCLK_ID_APB" value="5" caption="Index for RSTC APB clock"/>
              <param name="PAC_ID" value="5" caption="Index for RSTC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="03608" name2="tmr_rtc_u2250_v3" version="3b0">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x45006000"/>
            <signals>
              <signal group="IN" index="0" function="RTC_PAD_IE" pad="PA07"/>
              <signal group="IN" index="1" function="RTC_PAD_IE" pad="PA08"/>
              <signal group="IN" index="2" function="RTC_PAD_IE" pad="PA09"/>
              <signal group="IN" index="3" function="RTC_PAD_IE" pad="PB00"/>
              <signal group="OUT" index="0" function="_RTC_PAD_OE_N" pad="PB03"/>
              <signal group="OUT" index="1" function="_RTC_PAD_OE_N" pad="PB04"/>
              <signal group="OUT" index="2" function="_RTC_PAD_OE_N" pad="PB05"/>
              <signal group="OUT" index="3" function="_RTC_PAD_OE_N" pad="PB06"/>
            </signals>
            <parameters>
              <param name="NUM_OF_ALARMS" value="2" caption="--"/>
              <param name="NUM_OF_BKREGS" value="0" caption="--"/>
              <param name="NUM_OF_COMP16" value="4" caption="=2 * RTC_NUM_OF_ALARMS"/>
              <param name="NUM_OF_TAMPERS" value="8" caption="--"/>
              <param name="DMAC_ID_TIMESTAMP" value="3"/>
              <param name="BRIDGE_ID" value="2" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="3" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="12" caption="Instance index for RTC"/>
              <param name="MCLK_ID_APB" value="12" caption="Index for RTC APB clock"/>
              <param name="PAC_ID" value="12" caption="Index for RTC registers write protection"/>
            </parameters>
          </instance>
        </module>
