zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
          <instance name="TCC6">
            <register-group name="TCC6" name-in-module="TCC" address-space="base" offset="0x44828000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA01" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PA02" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="0" caption="Dithering feature implemented"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="GCLK_ID" value="32"/>
              <param name="DMAC_ID_OVF" value="34"/>
              <param name="DMAC_ID_MC0" value="35"/>
              <param name="DMAC_ID_MC1" value="36"/>
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="20" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="38" caption="Instance index for TCC6"/>
              <param name="MCLK_ID_APB" value="48" caption="Index for TCC6 APB clock"/>
              <param name="PAC_ID" value="38" caption="Index for TCC6 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="TESTVAL" id="test_valio_mapper_v1" name2="test_valio_mapper_v1" version="1.0.0">
          <instance name="TESTVAL">
            <signals>
              <signal group="VALIO" index="0" function="VALIO" pad="PD00"/>
              <signal group="VALIO" index="1" function="VALIO" pad="PD01"/>
              <signal group="VALIO" index="2" function="VALIO" pad="PC04"/>
              <signal group="VALIO" index="3" function="VALIO" pad="PA05"/>
              <signal group="VALIO" index="4" function="VALIO" pad="PC01"/>
              <signal group="VALIO" index="5" function="VALIO" pad="PC02"/>
            </signals>
          </instance>
        </module>
        <module name="USB" id="03613" name2="usb_u2222_v1" version="1d0">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x44832000"/>
            <signals>
              <signal group="SOF" function="H" pad="PD01"/>
              <signal group="USBDM" function="H" pad="PD02"/>
              <signal group="USBDP" function="H" pad="PD03"/>
            </signals>
            <parameters>
              <param name="AHB_2_USB_FIFO_DEPTH" value="4" caption="bytes number, should be at least 2, and 2^n (4,8,16 ...)"/>
              <param name="AHB_2_USB_RD_DATA_BITS" value="8" caption="8, 16 or 32, here : 8-bits is required as UTMI interface should work in 8-bits mode"/>
              <param name="AHB_2_USB_WR_DATA_BITS" value="32" caption="8, 16 or 32 : here, AHB transfer is made in word mode"/>
              <param name="AHB_2_USB_WR_THRESHOLD" value="2" caption="as soon as there are N bytes-free inside the fifo, ahb read transfer is requested"/>
              <param name="DATA_BUS_16_8" value="0" caption="UTMI/SIE data bus size : 0 -&gt; 8 bits, 1 -&gt; 16 bits"/>
              <param name="EPNUM" value="8" caption="parameter for rtl : max of ENDPOINT and PIPE NUM"/>
              <param name="EPT_NUM" value="8" caption="Number of USB end points"/>
              <param name="INITIAL_CONTROL_QOS" value="3" caption="CONTROL QOS RESET value"/>
              <param name="INITIAL_DATA_QOS" value="3" caption="DATA QOS RESET value"/>
              <param name="MISSING_SOF_DET_IMPLEMENTED" value="1" caption="48 mHz xPLL feature implemented"/>
              <param name="PIPE_NUM" value="8" caption="Number of USB pipes"/>
              <param name="SYSTEM_CLOCK_IS_CKUSB" value="0" caption="Dual (1'b0) or Single (1'b1) clock system"/>
              <param name="USB_2_AHB_FIFO_DEPTH" value="4" caption="bytes number, should be at least 2, and 2^n (4,8,16 ...)"/>
              <param name="USB_2_AHB_RD_DATA_BITS" value="16" caption="8, 16 or 32, here : 8-bits is required as UTMI interface should work in 8-bits mode"/>
              <param name="USB_2_AHB_RD_THRESHOLD" value="2" caption="as soon as there are 16 bytes-free inside the fifo, ahb read transfer is requested"/>
              <param name="USB_2_AHB_WR_DATA_BITS" value="8" caption="8, 16 or 32 : here : 8-bits is required as UTMI interface should work in 8-bits mode"/>
              <param name="GCLK_ID" value="38"/>
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="25" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="44" caption="Instance index for USB"/>
              <param name="MCLK_ID_AHB" value="54" caption="Index for USB AHB clock"/>
              <param name="MCLK_ID_APB" value="55" caption="Index for USB APB clock"/>
              <param name="PAC_ID" value="44" caption="Index for USB registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="03611" name2="wdt_u2251_v2" version="2b0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x4400E000"/>
            <parameters>
              <param name="FUSES_UPDATE_SUPPORT" value="0" caption="WDT Fuse Update Support"/>
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID"/>
              <param name="PERIPH_ID" value="7" caption="H2PB Peripheral ID"/>
              <param name="INSTANCE_ID" value="11" caption="Instance index for WDT"/>
              <param name="MCLK_ID_APB" value="11" caption="Index for WDT APB clock"/>
              <param name="PAC_ID" value="11" caption="Index for WDT registers write protection"/>
            </parameters>
          </instance>
        </module>
