zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
        <register name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Control C Register">
          <bitfield name="CNT" caption="Clock Divider for Synchronous Trigger" mask="0xFFFF"/>
          <bitfield name="COREINTERLEAVED" caption="Number of Core to Interleave Triggers" mask="0x70000000"/>
        </register>
        <register name="CTRLD" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Control D Register">
          <bitfield name="CTLCKDIV" caption="Control Clock Divider" mask="0x3F00"/>
          <bitfield name="CHNEN0" caption="Core 0 Digital Channel Enable" mask="0x10000"/>
          <bitfield name="ANLEN0" caption="Analog and Bias circuitry Enable for core 0" mask="0x100000"/>
          <bitfield name="WKUPEXP" caption="Wakeup cycles" mask="0xF000000"/>
          <bitfield name="VREFSEL" caption="Voltage Reference Select" mask="0x70000000" values="CTRLD__VREFSEL"/>
        </register>
        <register-group name="CONFIG" name-in-module="CONFIG" offset="0x020" size="0x20" count="1"/>
        <register name="CMPCTRL" offset="0xB0" rw="RW" size="4" initval="0x00000000" caption="Comparator Control">
          <bitfield name="ADCMPLO" caption="Low Limit of Digital Comparator" mask="0xFFF"/>
          <bitfield name="CMPEN" caption="Comparator Enable" mask="0x1000"/>
          <bitfield name="IELOLO" caption="Enable VAL &lt; CMPLO" mask="0x2000"/>
          <bitfield name="IELOHI" caption="Enable VAL &gt;= CMPLO" mask="0x4000"/>
          <bitfield name="IEBTWN" caption="Enable CMPLO &lt;= VAL &lt; CMPHI" mask="0x8000"/>
          <bitfield name="ADCMPHI" caption="High Limit of Digital Comparator" mask="0xFFF0000"/>
          <bitfield name="IEHILO" caption="Enable VAL &lt; CMPHI" mask="0x10000000"/>
          <bitfield name="IEHIHI" caption="Enable VAL &gt;= CMPHI" mask="0x20000000"/>
        </register>
        <register name="FLTCTRL" offset="0xC0" rw="RW" size="4" initval="0x00000000" caption="Filter Control">
          <bitfield name="OVRSAM" caption="Oversampling Ratio" mask="0x7" values="FLTCTRL__OVRSAM"/>
          <bitfield name="FMODE" caption="Filter Mode" mask="0x8"/>
          <bitfield name="DATA16EN" caption="16bit Averaging Mode" mask="0x10"/>
          <bitfield name="FLTEN" caption="Filter Enable" mask="0x100"/>
          <bitfield name="FLTCHNID" caption="Channel ID" mask="0x3C00"/>
        </register>
        <register name="CORCHDATAID" offset="0xD0" rw="RW" size="4" initval="0x00000000" caption="Channel Ready DATA ID">
          <bitfield name="CHRDYID" caption="Channel Read ID" mask="0xF"/>
          <bitfield name="CORDYID" caption="Core Read ID" mask="0x30"/>
        </register>
        <register name="CHRDYDAT" offset="0xD4" rw="RW" size="4" initval="0x00000000" caption="Channel Ready Data Register">
          <bitfield name="CHRDYDAT" caption="Channel Output Data" mask="0xFFFF"/>
          <bitfield name="LVL" caption="Level Setting" mask="0x1000000"/>
          <bitfield name="DIFF" caption="Differential Setting" mask="0x2000000"/>
          <bitfield name="SIGN" caption="Sign Setting" mask="0x4000000"/>
          <bitfield name="FRACT" caption="Fractional Setting" mask="0x8000000"/>
        </register>
        <register name="PFFDATA" offset="0xD8" rw="R" size="4" initval="0x00000000" caption="APB FIFO Output Data">
          <bitfield name="PFFDATA" caption="SARCORE Conversion data from the APB FIFO" mask="0xFFFF"/>
          <bitfield name="PFFCHNID" caption="Channel ID from APB FIFO" mask="0xF0000"/>
          <bitfield name="PFFCORID" caption="Core ID from APB FIFO" mask="0x300000"/>
          <bitfield name="PFFSIGN" caption="Channel Sign from the APB FIFO" mask="0x400000"/>
          <bitfield name="PFFFRACT" caption="Fractional Setting from APB FIFO" mask="0x800000"/>
          <bitfield name="PFFCNT" caption="Current Data Entries in APB FIFO" mask="0xFF000000"/>
        </register>
        <register name="DMABASE" offset="0xDC" rw="RW" size="4" initval="0x00000000" caption="DMA Sample Base Address">
          <bitfield name="DMABASE" caption="DMA Sample Value Base Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DMACTRL" offset="0xE0" rw="RW" size="4" initval="0x00000000" caption="DMA Control Register">
          <bitfield name="DMAEN" caption="DMA Enable" mask="0x2"/>
          <bitfield name="DMACR0" caption="DMA CORE0 Enable" mask="0x10"/>
          <bitfield name="DMABL" caption="DMA System RAM Buffer Length" mask="0x700"/>
        </register>
        <register name="PFFCTRL" offset="0xE4" rw="RW" size="4" initval="0x00000000" caption="APB FIFO Control Register">
          <bitfield name="PFFEN" caption="APB FIFO Enable" mask="0x2"/>
          <bitfield name="PFFCR0" caption="APB CORE 0 FIFO Enable" mask="0x10"/>
          <bitfield name="PFFRDYDM" caption="DMA APB FIFO Data Ready" mask="0x10000" values="PFFCTRL__PFFRDYDM"/>
        </register>
        <register name="SYNCBUSY" offset="0xE8" rw="R" size="4" initval="0x00000000" caption="CORE SYNC Busy Status Register">
          <bitfield name="SWRST" caption="Software Reset Sync Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable bit Sync Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB sync busy" mask="0x4"/>
        </register>
        <register name="DMAINTENCLR" offset="0xF0" rw="RW" size="4" atomic-op="clear:DMAINTENCLR" initval="0x00000000" caption="DMA Interrupt Enable Clear">
          <bitfield name="RAF" caption="Ram Buffer A Full" mask="0xF"/>
          <bitfield name="RBF" caption="Ram Buffer B Full" mask="0xF0"/>
          <bitfield name="SOVFL" caption="Synchonizer Overflow" mask="0x10000"/>
        </register>
        <register name="DMAINTSET" offset="0xF4" rw="RW" size="4" atomic-op="set:DMAINTSET" initval="0x00000000" caption="DMA Interrupt Enable Set">
          <bitfield name="RAF" caption="Ram Buffer A Full" mask="0xF"/>
          <bitfield name="RBF" caption="Ram Buffer B Full" mask="0xF0"/>
          <bitfield name="SOVFL" caption="Synchonizer Overflow" mask="0x10000"/>
        </register>
        <register name="DMAINTFLAG" offset="0xF8" rw="RW" size="4" atomic-op="clear:DMAINTFLAG" initval="0x00000000" caption="DMA Interrupt Flag and Status">
          <bitfield name="RAF" caption="Ram Buffer A Full" mask="0xF"/>
          <bitfield name="RBF" caption="Ram Buffer B Full" mask="0xF0"/>
          <bitfield name="EAF" caption="Ram Buffer A Overflow Error" mask="0xF00"/>
          <bitfield name="EBF" caption="Ram Buffer B Overflow Error" mask="0xF000"/>
          <bitfield name="SOVFL" caption="Synchronizer overflow" mask="0x10000"/>
          <bitfield name="DMAERR" caption="DMA Bus Error" mask="0x20000"/>
        </register>
        <register name="CTLINTENSET" offset="0xFC" rw="RW" size="4" atomic-op="set:CTLINTENSET" initval="0x00000000" caption="CORE Controller Interrupt Enable Set">
          <bitfield name="CRRDY0" caption="Core 0 Ready" mask="0x1"/>
          <bitfield name="VREFUPD" caption="VREF update" mask="0x40"/>
          <bitfield name="VREFRDY" caption="VREF Ready" mask="0x80"/>
          <bitfield name="PFFUNF" caption="APB FIFO Underflow" mask="0x100"/>
          <bitfield name="PFFOVF" caption="APB FIFO Overflow" mask="0x200"/>
          <bitfield name="PFFRDY" caption="APB FIFO Ready" mask="0x400"/>
          <bitfield name="PFFHFUL" caption="APB FIFO Half Full" mask="0x800"/>
        </register>
        <register name="CTLINTENCLR" offset="0x100" rw="RW" size="4" atomic-op="clear:CTLINTENCLR" initval="0x00000000" caption="CORE Controller Interrupt Enable Clear">
          <bitfield name="CRRDY0" caption="Core Ready 0 Disable" mask="0x1"/>
          <bitfield name="VREFUPD" caption="VREF Update" mask="0x40"/>
          <bitfield name="VREFRDY" caption="VREF Ready" mask="0x80"/>
          <bitfield name="PFFUNF" caption="APB FIFO underflow" mask="0x100"/>
          <bitfield name="PFFOVF" caption="APB FIFO overflow" mask="0x200"/>
          <bitfield name="PFFRDY" caption="APB FIFO Ready" mask="0x400"/>
          <bitfield name="PFFHFUL" caption="APB FIFO Half Full" mask="0x800"/>
        </register>
        <register name="CTLINTFLAG" offset="0x104" rw="RW" size="4" atomic-op="clear:CTLINTFLAG" initval="0x00000000" caption="CORE Controller Interrupt Flags">
          <bitfield name="CRRDY" caption="Core Ready" mask="0xF"/>
          <bitfield name="VREFUPD" caption="VREF update" mask="0x40"/>
          <bitfield name="VREFRDY" caption="VREF Ready" mask="0x80"/>
          <bitfield name="PFFUNF" caption="APB FIFO underflow" mask="0x100"/>
          <bitfield name="PFFOVF" caption="APB FIFO overflow" mask="0x200"/>
          <bitfield name="PFFRDY" caption="APB FIFO Ready" mask="0x400"/>
          <bitfield name="PFFHFUL" caption="APB FIFO Half Full" mask="0x800"/>
        </register>
