zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
        <register name="ECR" offset="0x140" rw="R" size="4" initval="0x00000000" caption="Error Counter">
          <bitfield name="TEC" caption="Transmit Error Counter" mask="0xFF"/>
          <bitfield name="REC" caption="Receive Error Counter" mask="0x7F00"/>
          <bitfield name="RP" caption="Receive Error Passive" mask="0x8000"/>
          <bitfield name="CEL" caption="CAN Error Logging" mask="0xFF0000"/>
        </register>
        <register name="PSR" offset="0x144" rw="R" size="4" initval="0x00000707" caption="Protocol Status">
          <bitfield name="LEC" caption="Last Error Code" mask="0x7" values="PSR__LEC"/>
          <bitfield name="ACT" caption="Activity" mask="0x18" values="PSR__ACT"/>
          <bitfield name="EP" caption="Error Passive" mask="0x20"/>
          <bitfield name="EW" caption="Warning Status" mask="0x40"/>
          <bitfield name="BO" caption="Bus_Off Status" mask="0x80"/>
          <bitfield name="DLEC" caption="Data Phase Last Error Code" mask="0x700" values="PSR__DLEC"/>
          <bitfield name="RESI" caption="ESI flag of last received CAN FD Message" mask="0x800"/>
          <bitfield name="RBRS" caption="BRS flag of last received CAN FD Message" mask="0x1000"/>
          <bitfield name="RFDF" caption="Received a CAN FD Message" mask="0x2000"/>
          <bitfield name="PXE" caption="Protocol Exception Event" mask="0x4000"/>
          <bitfield name="TDCV" caption="Transmitter Delay Compensation Value" mask="0x7F0000"/>
        </register>
        <register name="TDCR" offset="0x148" rw="RW" size="4" initval="0x00000000" caption="Extended ID Filter Configuration">
          <bitfield name="TDCF" caption="Transmitter Delay Compensation Filter Length" mask="0x7F"/>
          <bitfield name="TDCO" caption="Transmitter Delay Compensation Offset" mask="0x7F00"/>
        </register>
        <register name="IR" offset="0x150" rw="RW" size="4" initval="0x00000000" caption="Interrupt">
          <bitfield name="RF0N" caption="Rx FIFO 0 New Message" mask="0x1"/>
          <bitfield name="RF0W" caption="Rx FIFO 0 Watermark Reached" mask="0x2"/>
          <bitfield name="RF0F" caption="Rx FIFO 0 Full" mask="0x4"/>
          <bitfield name="RF0L" caption="Rx FIFO 0 Message Lost" mask="0x8"/>
          <bitfield name="RF1N" caption="Rx FIFO 1 New Message" mask="0x10"/>
          <bitfield name="RF1W" caption="Rx FIFO 1 Watermark Reached" mask="0x20"/>
          <bitfield name="RF1F" caption="Rx FIFO 1 FIFO Full" mask="0x40"/>
          <bitfield name="RF1L" caption="Rx FIFO 1 Message Lost" mask="0x80"/>
          <bitfield name="HPM" caption="High Priority Message" mask="0x100"/>
          <bitfield name="TC" caption="Timestamp Completed" mask="0x200"/>
          <bitfield name="TCF" caption="Transmission Cancellation Finished" mask="0x400"/>
          <bitfield name="TFE" caption="Tx FIFO Empty" mask="0x800"/>
          <bitfield name="TEFN" caption="Tx Event FIFO New Entry" mask="0x1000"/>
          <bitfield name="TEFW" caption="Tx Event FIFO Watermark Reached" mask="0x2000"/>
          <bitfield name="TEFF" caption="Tx Event FIFO Full" mask="0x4000"/>
          <bitfield name="TEFL" caption="Tx Event FIFO Element Lost" mask="0x8000"/>
          <bitfield name="TSW" caption="Timestamp Wraparound" mask="0x10000"/>
          <bitfield name="MRAF" caption="Message RAM Access Failure" mask="0x20000"/>
          <bitfield name="TOO" caption="Timeout Occurred" mask="0x40000"/>
          <bitfield name="DRX" caption="Message stored to Dedicated Rx Buffer" mask="0x80000"/>
          <bitfield name="ELO" caption="Error Logging Overflow" mask="0x400000"/>
          <bitfield name="EP" caption="Error Passive" mask="0x800000"/>
          <bitfield name="EW" caption="Warning Status" mask="0x1000000"/>
          <bitfield name="BO" caption="Bus_Off Status" mask="0x2000000"/>
          <bitfield name="WDI" caption="Watchdog Interrupt" mask="0x4000000"/>
          <bitfield name="PEA" caption="Protocol Error in Arbitration Phase" mask="0x8000000"/>
          <bitfield name="PED" caption="Protocol Error in Data Phase" mask="0x10000000"/>
          <bitfield name="ARA" caption="Access to Reserved Address" mask="0x20000000"/>
        </register>
        <register name="IE" offset="0x154" rw="RW" size="4" initval="0x00000000" caption="Interrupt Enable">
          <bitfield name="RF0NE" caption="Rx FIFO 0 New Message Interrupt Enable" mask="0x1"/>
          <bitfield name="RF0WE" caption="Rx FIFO 0 Watermark Reached Interrupt Enable" mask="0x2"/>
          <bitfield name="RF0FE" caption="Rx FIFO 0 Full Interrupt Enable" mask="0x4"/>
          <bitfield name="RF0LE" caption="Rx FIFO 0 Message Lost Interrupt Enable" mask="0x8"/>
          <bitfield name="RF1NE" caption="Rx FIFO 1 New Message Interrupt Enable" mask="0x10"/>
          <bitfield name="RF1WE" caption="Rx FIFO 1 Watermark Reached Interrupt Enable" mask="0x20"/>
          <bitfield name="RF1FE" caption="Rx FIFO 1 FIFO Full Interrupt Enable" mask="0x40"/>
          <bitfield name="RF1LE" caption="Rx FIFO 1 Message Lost Interrupt Enable" mask="0x80"/>
          <bitfield name="HPME" caption="High Priority Message Interrupt Enable" mask="0x100"/>
          <bitfield name="TCE" caption="Timestamp Completed Interrupt Enable" mask="0x200"/>
          <bitfield name="TCFE" caption="Transmission Cancellation Finished Interrupt Enable" mask="0x400"/>
          <bitfield name="TFEE" caption="Tx FIFO Empty Interrupt Enable" mask="0x800"/>
          <bitfield name="TEFNE" caption="Tx Event FIFO New Entry Interrupt Enable" mask="0x1000"/>
          <bitfield name="TEFWE" caption="Tx Event FIFO Watermark Reached Interrupt Enable" mask="0x2000"/>
          <bitfield name="TEFFE" caption="Tx Event FIFO Full Interrupt Enable" mask="0x4000"/>
          <bitfield name="TEFLE" caption="Tx Event FIFO Element Lost Interrupt Enable" mask="0x8000"/>
          <bitfield name="TSWE" caption="Timestamp Wraparound Interrupt Enable" mask="0x10000"/>
          <bitfield name="MRAFE" caption="Message RAM Access Failure Interrupt Enable" mask="0x20000"/>
          <bitfield name="TOOE" caption="Timeout Occurred Interrupt Enable" mask="0x40000"/>
          <bitfield name="DRXE" caption="Message stored to Dedicated Rx Buffer Interrupt Enable" mask="0x80000"/>
          <bitfield name="ELOE" caption="Error Logging Overflow Interrupt Enable" mask="0x400000"/>
          <bitfield name="EPE" caption="Error Passive Interrupt Enable" mask="0x800000"/>
          <bitfield name="EWE" caption="Warning Status Interrupt Enable" mask="0x1000000"/>
          <bitfield name="BOE" caption="Bus_Off Status Interrupt Enable" mask="0x2000000"/>
          <bitfield name="WDIE" caption="Watchdog Interrupt Interrupt Enable" mask="0x4000000"/>
          <bitfield name="PEAE" caption="Protocol Error in Arbitration Phase Enable" mask="0x8000000"/>
          <bitfield name="PEDE" caption="Protocol Error in Data Phase Enable" mask="0x10000000"/>
          <bitfield name="ARAE" caption="Access to Reserved Address Enable" mask="0x20000000"/>
        </register>
        <register name="ILS" offset="0x158" rw="RW" size="4" initval="0x00000000" caption="Interrupt Line Select">
          <bitfield name="RF0NL" caption="Rx FIFO 0 New Message Interrupt Line" mask="0x1"/>
          <bitfield name="RF0WL" caption="Rx FIFO 0 Watermark Reached Interrupt Line" mask="0x2"/>
          <bitfield name="RF0FL" caption="Rx FIFO 0 Full Interrupt Line" mask="0x4"/>
          <bitfield name="RF0LL" caption="Rx FIFO 0 Message Lost Interrupt Line" mask="0x8"/>
          <bitfield name="RF1NL" caption="Rx FIFO 1 New Message Interrupt Line" mask="0x10"/>
          <bitfield name="RF1WL" caption="Rx FIFO 1 Watermark Reached Interrupt Line" mask="0x20"/>
          <bitfield name="RF1FL" caption="Rx FIFO 1 FIFO Full Interrupt Line" mask="0x40"/>
          <bitfield name="RF1LL" caption="Rx FIFO 1 Message Lost Interrupt Line" mask="0x80"/>
          <bitfield name="HPML" caption="High Priority Message Interrupt Line" mask="0x100"/>
          <bitfield name="TCL" caption="Timestamp Completed Interrupt Line" mask="0x200"/>
          <bitfield name="TCFL" caption="Transmission Cancellation Finished Interrupt Line" mask="0x400"/>
          <bitfield name="TFEL" caption="Tx FIFO Empty Interrupt Line" mask="0x800"/>
          <bitfield name="TEFNL" caption="Tx Event FIFO New Entry Interrupt Line" mask="0x1000"/>
          <bitfield name="TEFWL" caption="Tx Event FIFO Watermark Reached Interrupt Line" mask="0x2000"/>
          <bitfield name="TEFFL" caption="Tx Event FIFO Full Interrupt Line" mask="0x4000"/>
          <bitfield name="TEFLL" caption="Tx Event FIFO Element Lost Interrupt Line" mask="0x8000"/>
          <bitfield name="TSWL" caption="Timestamp Wraparound Interrupt Line" mask="0x10000"/>
          <bitfield name="MRAFL" caption="Message RAM Access Failure Interrupt Line" mask="0x20000"/>
          <bitfield name="TOOL" caption="Timeout Occurred Interrupt Line" mask="0x40000"/>
          <bitfield name="DRXL" caption="Message stored to Dedicated Rx Buffer Interrupt Line" mask="0x80000"/>
          <bitfield name="ELOL" caption="Error Logging Overflow Interrupt Line" mask="0x400000"/>
          <bitfield name="EPL" caption="Error Passive Interrupt Line" mask="0x800000"/>
          <bitfield name="EWL" caption="Warning Status Interrupt Line" mask="0x1000000"/>
          <bitfield name="BOL" caption="Bus_Off Status Interrupt Line" mask="0x2000000"/>
          <bitfield name="WDIL" caption="Watchdog Interrupt Interrupt Line" mask="0x4000000"/>
          <bitfield name="PEAL" caption="Protocol Error in Arbitration Phase Line" mask="0x8000000"/>
          <bitfield name="PEDL" caption="Protocol Error in Data Phase Line" mask="0x10000000"/>
          <bitfield name="ARAL" caption="Access to Reserved Address Line" mask="0x20000000"/>
        </register>
        <register name="ILE" offset="0x15C" rw="RW" size="4" initval="0x00000000" caption="Interrupt Line Enable">
          <bitfield name="EINT0" caption="Enable Interrupt Line 0" mask="0x1"/>
          <bitfield name="EINT1" caption="Enable Interrupt Line 1" mask="0x2"/>
        </register>
        <register name="GFC" offset="0x180" rw="RW" size="4" initval="0x00000000" caption="Global Filter Configuration">
          <bitfield name="RRFE" caption="Reject Remote Frames Extended" mask="0x1"/>
          <bitfield name="RRFS" caption="Reject Remote Frames Standard" mask="0x2"/>
          <bitfield name="ANFE" caption="Accept Non-matching Frames Extended" mask="0xC" values="GFC__ANFE"/>
          <bitfield name="ANFS" caption="Accept Non-matching Frames Standard" mask="0x30" values="GFC__ANFS"/>
        </register>
        <register name="SIDFC" offset="0x184" rw="RW" size="4" initval="0x00000000" caption="Standard ID Filter Configuration">
          <bitfield name="FLSSA" caption="Filter List Standard Start Address" mask="0xFFFC"/>
          <bitfield name="LSS" caption="List Size Standard" mask="0xFF0000"/>
        </register>
        <register name="XIDFC" offset="0x188" rw="RW" size="4" initval="0x00000000" caption="Extended ID Filter Configuration">
          <bitfield name="FLESA" caption="Filter List Extended Start Address" mask="0xFFFC"/>
          <bitfield name="LSE" caption="List Size Extended" mask="0x7F0000"/>
        </register>
        <register name="XIDAM" offset="0x190" rw="RW" size="4" initval="0x1FFFFFFF" caption="Extended ID AND Mask">
          <bitfield name="EIDM" caption="Extended ID Mask" mask="0x1FFFFFFF"/>
        </register>
