zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
        <register name="HPMS" offset="0x194" rw="R" size="4" initval="0x00000000" caption="High Priority Message Status">
          <bitfield name="BIDX" caption="Buffer Index" mask="0x3F"/>
          <bitfield name="MSI" caption="Message Storage Indicator" mask="0xC0" values="HPMS__MSI"/>
          <bitfield name="FIDX" caption="Filter Index" mask="0x7F00"/>
          <bitfield name="FLST" caption="Filter List" mask="0x8000"/>
        </register>
        <register name="NDAT1" offset="0x198" rw="RW" size="4" initval="0x00000000" caption="New Data 1">
          <bitfield name="ND0" caption="New Data 0" mask="0x1"/>
          <bitfield name="ND1" caption="New Data 1" mask="0x2"/>
          <bitfield name="ND2" caption="New Data 2" mask="0x4"/>
          <bitfield name="ND3" caption="New Data 3" mask="0x8"/>
          <bitfield name="ND4" caption="New Data 4" mask="0x10"/>
          <bitfield name="ND5" caption="New Data 5" mask="0x20"/>
          <bitfield name="ND6" caption="New Data 6" mask="0x40"/>
          <bitfield name="ND7" caption="New Data 7" mask="0x80"/>
          <bitfield name="ND8" caption="New Data 8" mask="0x100"/>
          <bitfield name="ND9" caption="New Data 9" mask="0x200"/>
          <bitfield name="ND10" caption="New Data 10" mask="0x400"/>
          <bitfield name="ND11" caption="New Data 11" mask="0x800"/>
          <bitfield name="ND12" caption="New Data 12" mask="0x1000"/>
          <bitfield name="ND13" caption="New Data 13" mask="0x2000"/>
          <bitfield name="ND14" caption="New Data 14" mask="0x4000"/>
          <bitfield name="ND15" caption="New Data 15" mask="0x8000"/>
          <bitfield name="ND16" caption="New Data 16" mask="0x10000"/>
          <bitfield name="ND17" caption="New Data 17" mask="0x20000"/>
          <bitfield name="ND18" caption="New Data 18" mask="0x40000"/>
          <bitfield name="ND19" caption="New Data 19" mask="0x80000"/>
          <bitfield name="ND20" caption="New Data 20" mask="0x100000"/>
          <bitfield name="ND21" caption="New Data 21" mask="0x200000"/>
          <bitfield name="ND22" caption="New Data 22" mask="0x400000"/>
          <bitfield name="ND23" caption="New Data 23" mask="0x800000"/>
          <bitfield name="ND24" caption="New Data 24" mask="0x1000000"/>
          <bitfield name="ND25" caption="New Data 25" mask="0x2000000"/>
          <bitfield name="ND26" caption="New Data 26" mask="0x4000000"/>
          <bitfield name="ND27" caption="New Data 27" mask="0x8000000"/>
          <bitfield name="ND28" caption="New Data 28" mask="0x10000000"/>
          <bitfield name="ND29" caption="New Data 29" mask="0x20000000"/>
          <bitfield name="ND30" caption="New Data 30" mask="0x40000000"/>
          <bitfield name="ND31" caption="New Data 31" mask="0x80000000"/>
        </register>
        <register name="NDAT2" offset="0x19C" rw="RW" size="4" initval="0x00000000" caption="New Data 2">
          <bitfield name="ND32" caption="New Data 32" mask="0x1"/>
          <bitfield name="ND33" caption="New Data 33" mask="0x2"/>
          <bitfield name="ND34" caption="New Data 34" mask="0x4"/>
          <bitfield name="ND35" caption="New Data 35" mask="0x8"/>
          <bitfield name="ND36" caption="New Data 36" mask="0x10"/>
          <bitfield name="ND37" caption="New Data 37" mask="0x20"/>
          <bitfield name="ND38" caption="New Data 38" mask="0x40"/>
          <bitfield name="ND39" caption="New Data 39" mask="0x80"/>
          <bitfield name="ND40" caption="New Data 40" mask="0x100"/>
          <bitfield name="ND41" caption="New Data 41" mask="0x200"/>
          <bitfield name="ND42" caption="New Data 42" mask="0x400"/>
          <bitfield name="ND43" caption="New Data 43" mask="0x800"/>
          <bitfield name="ND44" caption="New Data 44" mask="0x1000"/>
          <bitfield name="ND45" caption="New Data 45" mask="0x2000"/>
          <bitfield name="ND46" caption="New Data 46" mask="0x4000"/>
          <bitfield name="ND47" caption="New Data 47" mask="0x8000"/>
          <bitfield name="ND48" caption="New Data 48" mask="0x10000"/>
          <bitfield name="ND49" caption="New Data 49" mask="0x20000"/>
          <bitfield name="ND50" caption="New Data 50" mask="0x40000"/>
          <bitfield name="ND51" caption="New Data 51" mask="0x80000"/>
          <bitfield name="ND52" caption="New Data 52" mask="0x100000"/>
          <bitfield name="ND53" caption="New Data 53" mask="0x200000"/>
          <bitfield name="ND54" caption="New Data 54" mask="0x400000"/>
          <bitfield name="ND55" caption="New Data 55" mask="0x800000"/>
          <bitfield name="ND56" caption="New Data 56" mask="0x1000000"/>
          <bitfield name="ND57" caption="New Data 57" mask="0x2000000"/>
          <bitfield name="ND58" caption="New Data 58" mask="0x4000000"/>
          <bitfield name="ND59" caption="New Data 59" mask="0x8000000"/>
          <bitfield name="ND60" caption="New Data 60" mask="0x10000000"/>
          <bitfield name="ND61" caption="New Data 61" mask="0x20000000"/>
          <bitfield name="ND62" caption="New Data 62" mask="0x40000000"/>
          <bitfield name="ND63" caption="New Data 63" mask="0x80000000"/>
        </register>
        <register name="RXF0C" offset="0x1A0" rw="RW" size="4" initval="0x00000000" caption="Rx FIFO 0 Configuration">
          <bitfield name="F0SA" caption="Rx FIFO 0 Start Address" mask="0xFFFC"/>
          <bitfield name="F0S" caption="Rx FIFO 0 Size" mask="0x7F0000"/>
          <bitfield name="F0WM" caption="Rx FIFO 0 Watermark" mask="0x7F000000"/>
          <bitfield name="F0OM" caption="FIFO 0 Operation Mode" mask="0x80000000"/>
        </register>
        <register name="RXF0S" offset="0x1A4" rw="R" size="4" initval="0x00000000" caption="Rx FIFO 0 Status">
          <bitfield name="F0FL" caption="Rx FIFO 0 Fill Level" mask="0x7F"/>
          <bitfield name="F0GI" caption="Rx FIFO 0 Get Index" mask="0x3F00"/>
          <bitfield name="F0PI" caption="Rx FIFO 0 Put Index" mask="0x3F0000"/>
          <bitfield name="F0F" caption="Rx FIFO 0 Full" mask="0x1000000"/>
          <bitfield name="RF0L" caption="Rx FIFO 0 Message Lost" mask="0x2000000"/>
        </register>
        <register name="RXF0A" offset="0x1A8" rw="RW" size="4" initval="0x00000000" caption="Rx FIFO 0 Acknowledge">
          <bitfield name="F0AI" caption="Rx FIFO 0 Acknowledge Index" mask="0x3F"/>
        </register>
        <register name="RXBC" offset="0x1AC" rw="RW" size="4" initval="0x00000000" caption="Rx Buffer Configuration">
          <bitfield name="RBSA" caption="Rx Buffer Start Address" mask="0xFFFC"/>
        </register>
        <register name="RXF1C" offset="0x1B0" rw="RW" size="4" initval="0x00000000" caption="Rx FIFO 1 Configuration">
          <bitfield name="F1SA" caption="Rx FIFO 1 Start Address" mask="0xFFFC"/>
          <bitfield name="F1S" caption="Rx FIFO 1 Size" mask="0x7F0000"/>
          <bitfield name="F1WM" caption="Rx FIFO 1 Watermark" mask="0x7F000000"/>
          <bitfield name="F1OM" caption="FIFO 1 Operation Mode" mask="0x80000000"/>
        </register>
        <register name="RXF1S" offset="0x1B4" rw="R" size="4" initval="0x00000000" caption="Rx FIFO 1 Status">
          <bitfield name="F1FL" caption="Rx FIFO 1 Fill Level" mask="0x7F"/>
          <bitfield name="F1GI" caption="Rx FIFO 1 Get Index" mask="0x3F00"/>
          <bitfield name="F1PI" caption="Rx FIFO 1 Put Index" mask="0x3F0000"/>
          <bitfield name="F1F" caption="Rx FIFO 1 Full" mask="0x1000000"/>
          <bitfield name="RF1L" caption="Rx FIFO 1 Message Lost" mask="0x2000000"/>
          <bitfield name="DMS" caption="Debug Message Status" mask="0xC0000000" values="RXF1S__DMS"/>
        </register>
        <register name="RXF1A" offset="0x1B8" rw="RW" size="4" initval="0x00000000" caption="Rx FIFO 1 Acknowledge">
          <bitfield name="F1AI" caption="Rx FIFO 1 Acknowledge Index" mask="0x3F"/>
        </register>
