zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
      <value-group name="S0__SFT">
        <value name="RANGE" caption="Range filter from SFID1 to SFID2" value="0"/>
        <value name="DUAL" caption="Dual ID filter for SFID1 or SFID2" value="1"/>
        <value name="CLASSIC" caption="Classic filter" value="2"/>
      </value-group>
      <value-group name="E1__ET">
        <value name="TXE" caption="Tx event" value="1"/>
        <value name="TXC" caption="Transmission in spite of cancellation" value="2"/>
      </value-group>
      <value-group name="F0__EFEC">
        <value name="DISABLE" caption="Disable filter element" value="0"/>
        <value name="STF0M" caption="Store in Rx FIFO 0 if filter match" value="1"/>
        <value name="STF1M" caption="Store in Rx FIFO 1 if filter match" value="2"/>
        <value name="REJECT" caption="Reject ID if filter match" value="3"/>
        <value name="PRIORITY" caption="Set priority if filter match" value="4"/>
        <value name="PRIF0M" caption="Set priority and store in FIFO 0 if filter match" value="5"/>
        <value name="PRIF1M" caption="Set priority and store in FIFO 1 if filter match" value="6"/>
        <value name="STRXBUF" caption="Store into Rx Buffer" value="7"/>
      </value-group>
      <value-group name="F1__EFT">
        <value name="RANGEM" caption="Range filter from EFID1 to EFID2" value="0"/>
        <value name="DUAL" caption="Dual ID filter for EFID1 or EFID2" value="1"/>
        <value name="CLASSIC" caption="Classic filter" value="2"/>
        <value name="RANGE" caption="Range filter from EFID1 to EFID2 with no XIDAM mask" value="3"/>
      </value-group>
    </module>
    <module name="CCL" id="03628" name2="cla_ccl_u2225_v2" version="2b0" caption="Configurable Custom Logic">
      <register-group name="CCL" caption="Configurable Custom Logic">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="CTRL__SWRST"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2" values="CTRL__ENABLE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40" values="CTRL__RUNSTDBY"/>
        </register>
        <register name="SEQCTRL" offset="0x4" rw="RW" size="1" count="2" initval="0x00" caption="SEQ Control x">
          <bitfield name="SEQSEL" caption="Sequential Selection" mask="0xF" values="SEQCTRL__SEQSEL"/>
        </register>
        <register name="LUTCTRL" offset="0x8" rw="RW" size="4" count="4" initval="0x00000000" caption="LUT Control x">
          <bitfield name="ENABLE" caption="LUT Enable" mask="0x2" values="LUTCTRL__ENABLE"/>
          <bitfield name="FILTSEL" caption="Filter Selection" mask="0x30" values="LUTCTRL__FILTSEL"/>
          <bitfield name="EDGESEL" caption="Edge Selection" mask="0x80" values="LUTCTRL__EDGESEL"/>
          <bitfield name="INSEL0" caption="Input Selection 0" mask="0xF00" values="LUTCTRL__INSEL0"/>
          <bitfield name="INSEL1" caption="Input Selection 1" mask="0xF000" values="LUTCTRL__INSEL1"/>
          <bitfield name="INSEL2" caption="Input Selection 2" mask="0xF0000" values="LUTCTRL__INSEL2"/>
          <bitfield name="INVEI" caption="Inverted Event Input Enable" mask="0x100000" values="LUTCTRL__INVEI"/>
          <bitfield name="LUTEI" caption="LUT Event Input Enable" mask="0x200000" values="LUTCTRL__LUTEI"/>
          <bitfield name="LUTEO" caption="LUT Event Output Enable" mask="0x400000" values="LUTCTRL__LUTEO"/>
          <bitfield name="TRUTH" caption="Truth Value" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="CTRL__SWRST">
        <value name="DISABLE" caption="The peripheral is not reset" value="0"/>
        <value name="ENABLE" caption="The peripheral is reset" value="1"/>
      </value-group>
      <value-group name="CTRL__ENABLE">
        <value name="DISABLE" caption="The peripheral is disabled" value="0"/>
        <value name="ENABLE" caption="The peripheral is enabled" value="1"/>
      </value-group>
      <value-group name="CTRL__RUNSTDBY">
        <value name="DISABLE" caption="Generic clock is not required in standby sleep mode" value="0"/>
        <value name="ENABLE" caption="Generic clock is  required in standby sleep mode" value="1"/>
      </value-group>
      <value-group name="SEQCTRL__SEQSEL">
        <value name="DISABLE" caption="Sequential logic is disabled" value="0"/>
        <value name="DFF" caption="D flip flop" value="1"/>
        <value name="JK" caption="JK flip flop" value="2"/>
        <value name="LATCH" caption="D latch" value="3"/>
        <value name="RS" caption="RS latch" value="4"/>
      </value-group>
      <value-group name="LUTCTRL__ENABLE">
        <value name="DISABLE" caption="LUT block is disabled" value="0"/>
        <value name="ENABLE" caption="LUT block is enabled" value="1"/>
      </value-group>
      <value-group name="LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
        <value name="FILTER" caption="Filter enabled" value="2"/>
      </value-group>
      <value-group name="LUTCTRL__EDGESEL">
        <value name="DISABLE" caption="Edge detector is disabled" value="0"/>
        <value name="ENABLE" caption="Edge detector is enabled" value="1"/>
      </value-group>
      <value-group name="LUTCTRL__INSEL0">
        <value name="MASK" caption="Masked input" value="0x0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="0x1"/>
        <value name="LINK" caption="Linked LUT input source" value="0x2"/>
        <value name="EVENT" caption="Event input source" value="0x3"/>
        <value name="IO" caption="I/O pin input source" value="0x4"/>
        <value name="PERSEL0" caption="Peripheral 0 input source" value="0x5"/>
        <value name="PERSEL1" caption="Peripheral 1 input source" value="0x6"/>
        <value name="PERSEL2" caption="Peripheral 2 input source" value="0x7"/>
        <value name="PERSEL3" caption="Peripheral 3 input source" value="0x8"/>
        <value name="PERSEL4" caption="Peripheral 4 input source" value="0x9"/>
        <value name="PERSEL5" caption="Peripheral 5 input source" value="0xA"/>
        <value name="ASYNCEVENT" caption="Asynchronous event input source. The EVENT input will bypass edge detection logic." value="0xB"/>
      </value-group>
      <value-group name="LUTCTRL__INSEL1">
        <value name="MASK" caption="Masked input" value="0x0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="0x1"/>
        <value name="LINK" caption="Linked LUT input source" value="0x2"/>
        <value name="EVENT" caption="Event input source" value="0x3"/>
        <value name="IO" caption="I/O pin input source" value="0x4"/>
        <value name="PERSEL0" caption="Peripheral 0 input source" value="0x5"/>
        <value name="PERSEL1" caption="Peripheral 1 input source" value="0x6"/>
        <value name="PERSEL2" caption="Peripheral 2 input source" value="0x7"/>
        <value name="PERSEL3" caption="Peripheral 3 input source" value="0x8"/>
        <value name="PERSEL4" caption="Peripheral 4 input source" value="0x9"/>
        <value name="PERSEL5" caption="Peripheral 5 input source" value="0xA"/>
        <value name="ASYNCEVENT" caption="Asynchronous event input source. The EVENT input will bypass edge detection logic." value="0xB"/>
      </value-group>
