zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
      <value-group name="LUTCTRL__INSEL2">
        <value name="MASK" caption="Masked input" value="0x0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="0x1"/>
        <value name="LINK" caption="Linked LUT input source" value="0x2"/>
        <value name="EVENT" caption="Event input source" value="0x3"/>
        <value name="IO" caption="I/O pin input source" value="0x4"/>
        <value name="PERSEL0" caption="Peripheral 0 input source" value="0x5"/>
        <value name="PERSEL1" caption="Peripheral 1 input source" value="0x6"/>
        <value name="PERSEL2" caption="Peripheral 2 input source" value="0x7"/>
        <value name="PERSEL3" caption="Peripheral 3 input source" value="0x8"/>
        <value name="PERSEL4" caption="Peripheral 4 input source" value="0x9"/>
        <value name="PERSEL5" caption="Peripheral 5 input source" value="0xA"/>
        <value name="ASYNCEVENT" caption="Asynchronous event input source. The EVENT input will bypass edge detection logic." value="0xB"/>
      </value-group>
      <value-group name="LUTCTRL__INVEI">
        <value name="NORMAL" caption="Incoming event is not inverted" value="0"/>
        <value name="INVERTED" caption="Incoming event is inverted" value="1"/>
      </value-group>
      <value-group name="LUTCTRL__LUTEI">
        <value name="DISABLE" caption="LUT incoming event is disabled" value="0"/>
        <value name="ENABLE" caption="LUT incoming event is enabled" value="1"/>
      </value-group>
      <value-group name="LUTCTRL__LUTEO">
        <value name="DISABLE" caption="LUT event output is disabled" value="0"/>
        <value name="ENABLE" caption="LUT event output is enabled" value="1"/>
      </value-group>
    </module>
    <module name="CoreDebug" id="SYSTEM_IP" version="1.0.0" caption="Debug Control Block">
      <register-group name="CoreDebug" caption="Debug Control Block">
        <register name="DHCSR" offset="0x0" rw="RW" size="4" access-size="4" caption="Debug Halting Control and Status Register">
          <bitfield name="C_DEBUGEN" caption="Enable Halting debug" mask="0x1"/>
          <bitfield name="C_HALT" caption="Halt processor" mask="0x2"/>
          <bitfield name="C_STEP" caption="Enable single step" mask="0x4"/>
          <bitfield name="C_MASKINTS" caption="Mask PendSV, SysTick and external configurable interrupts" mask="0x8"/>
          <bitfield name="S_SNAPSTALL" caption="Snap stall control" mask="0x20"/>
          <bitfield name="S_REGRDY" caption="Register ready status" mask="0x10000"/>
          <bitfield name="S_HALT" caption="Halted status" mask="0x20000"/>
          <bitfield name="S_SLEEP" caption="Sleeping status" mask="0x40000"/>
          <bitfield name="S_LOCKUP" caption="Lockup status" mask="0x80000"/>
          <bitfield name="S_SDE" caption="Secure debug enabled" mask="0x100000"/>
          <bitfield name="S_RETIRE_ST" caption="Retire sticky status" mask="0x1000000"/>
          <bitfield name="S_RESET_ST" caption="Reset sticky status" mask="0x2000000"/>
          <bitfield name="S_RESTART_ST" caption="Restart sticky status" mask="0x4000000"/>
        </register>
        <register name="DCRSR" offset="0x4" rw="W" size="4" access-size="4" caption="Debug Core Register Select Register">
          <bitfield name="REGSEL" caption="Register selector" mask="0x7F"/>
          <bitfield name="REGWnR" caption="Register write/not-read access" mask="0x10000"/>
        </register>
        <register name="DEMCR" offset="0xC" rw="RW" size="4" access-size="4" caption="Debug Exception and Monitor Control Register">
          <bitfield name="VC_CORERESET" caption="Core reset Halting debug vector catch enable" mask="0x1"/>
          <bitfield name="VC_MMERR" caption="MemManage exception Halting debug vector catch enable" mask="0x10"/>
          <bitfield name="VC_NOCPERR" caption="UsageFault exception coprocessor access Halting debug vector catch enable" mask="0x20"/>
          <bitfield name="VC_CHKERR" caption="UsageFault exception checking error Halting debug vector catch enable" mask="0x40"/>
          <bitfield name="VC_STATERR" caption="UsageFault exception state information error Halting debug vector catch enable" mask="0x80"/>
          <bitfield name="VC_BUSERR" caption="BusFault exception Halting debug vector catch enable" mask="0x100"/>
          <bitfield name="VC_INTERR" caption="Excception entry and return faults Halting debug vector catch enable" mask="0x200"/>
          <bitfield name="VC_HARDERR" caption="HardFault exception Halting debug vector catch enable" mask="0x400"/>
          <bitfield name="VC_SFERR" caption="SecureFault exception Halting debug vector catch enable" mask="0x800"/>
          <bitfield name="MON_EN" caption="DebugMonitor enable" mask="0x10000"/>
          <bitfield name="MON_PEND" caption="DebugMonitor pending state" mask="0x20000"/>
          <bitfield name="MON_STEP" caption="Enable DebugMonitor stepping" mask="0x40000"/>
          <bitfield name="MON_REQ" caption="DebugMonitor semaphore bit" mask="0x80000"/>
          <bitfield name="SDME" caption="Secure DebugMonitor enable" mask="0x100000"/>
          <bitfield name="TRCENA" caption="Global DWT and ITM features enable" mask="0x1000000"/>
        </register>
        <register name="DSCSR" offset="0x18" rw="RW" size="4" access-size="4" caption="Debug Security Control and Status Register">
          <bitfield name="SBRSELEN" caption="Secure Banked register select enable" mask="0x1"/>
          <bitfield name="SBRSEL" caption="Secure Banked register select" mask="0x2"/>
          <bitfield name="CDS" caption="Current domain Secure" mask="0x10000"/>
          <bitfield name="CDSKEY" caption="CDS field write-enable key" mask="0x20000"/>
        </register>
      </register-group>
    </module>
    <module name="DIB" id="SYSTEM_IP" version="1.0.0" caption="Debug Identification Block">
      <register-group name="DIB" caption="Debug Identification Block">
        <register name="DLAR" offset="0x0" rw="W" size="4" access-size="4" caption="SCS Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="DLAR__KEY"/>
        </register>
        <register name="DLSR" offset="0x4" rw="R" size="4" access-size="4" caption="SCS Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
