zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
      <value-group name="ECCCTRL__ECCCTL">
        <value name="STRICT" caption="ECC Writes with ECC Reads (NVMOP = Single Program Operation disabled)" value="0"/>
        <value name="DYNAMIC" caption="Dynamic Writes with Dynamic Reads" value="1"/>
        <value name="ECC" caption="ECC Writes with Dynamic Reads (NVMOP = Single Program Operation disabled)" value="2"/>
        <value name="DISABLE" caption="Dynamic Writes with No Error Check Reads" value="3"/>
      </value-group>
      <value-group name="ECCCTRL__ECCUNLCK">
        <value name="LOCKED" caption="ECCUNLCK and ECCCTL[1:0] cannot be written" value="0"/>
        <value name="UNLOCKED" caption="ECCUNLCK and ECCCTL[1:0] can be written" value="1"/>
      </value-group>
      <value-group name="CRCCTRL__CRCRST">
        <value name="NONE" caption="No Action" value="0"/>
        <value name="RESET" caption="Resets all CRC SFR bits." value="1"/>
      </value-group>
      <value-group name="CRCCTRL__CRCEN">
        <value name="DISABLE" caption="Stops CRC calculation." value="0"/>
        <value name="ENABLE" caption="CRC Calculation Enabled (w/ start on write to 1)." value="1"/>
      </value-group>
      <value-group name="CRCCTRL__RUNSTDBY">
        <value name="HALT" caption="CRC Halts in Standby" value="0"/>
        <value name="RUN" caption="CRC Runs in Standby but only if STATUS.PRM=0 (i.e. Flash is in Auto Standby)" value="1"/>
      </value-group>
      <value-group name="CRCMODE__PLEN32">
        <value name="SIXTEEN" caption="Polynomial is 16-bits" value="0"/>
        <value name="THIRTYTWO" caption="Polynomial is 32-bits" value="1"/>
      </value-group>
      <value-group name="CRCMODE__AUTOR">
        <value name="DISABLE" caption="Perform CRC calculation once then set DONE and if needed, CRCERR." value="0"/>
        <value name="ENABLE" caption="Continually Repeat CRC calculation; stop on error, set CRCDONE and CRCERR" value="1"/>
      </value-group>
      <value-group name="CRCMODE__ROUT">
        <value name="DISABLE" caption="The CRCACC is Not Reflected" value="0"/>
        <value name="ENABLE" caption="The CRCACC is Reflected (before the Final XOR)" value="1"/>
      </value-group>
      <value-group name="CRCMODE__RIN">
        <value name="DISABLE" caption="The LFSR CRC is calculated Most Significant Bit first (Not Reflected)" value="0"/>
        <value name="ENABLE" caption="The LFSR CRC is calculated Least Significant Bit first (Reflected)" value="1"/>
      </value-group>
      <value-group name="CRCPAUSE__PAUSE">
        <value name="DISABLE" caption="CRC Reads Flash as Required" value="0"/>
        <value name="ENABLE" caption="Pause CRC Reads of Flash" value="1"/>
      </value-group>
      <value-group name="CRCPOLY__CRCPOLY">
        <value name="0" caption="Disable the XOR input to the shift register at the associated bit position" value="0"/>
        <value name="1" caption="Enable the XOR input to the shift register at the associated bit position" value="1"/>
      </value-group>
      <value-group name="CRCFXOR__CRCFXOR">
        <value name="0" caption="Disable the Final XOR at the associated bit position" value="0"/>
        <value name="1" caption="Enable the Final XOR at the associated bit position" value="1"/>
      </value-group>
      <value-group name="FFLTCTRL__FLTRST">
        <value name="NONE" caption="No Action" value="0"/>
        <value name="RESET" caption="Resets all FLT SFR bits." value="1"/>
      </value-group>
      <value-group name="FFLTCTRL__FLTEN">
        <value name="DISABLE" caption="ECC Fault Injection Disabled" value="0"/>
        <value name="ENABLE" caption="ECC Fault Injection Enabled (module performs operation selected by FFLTMODE.FLTMD)" value="1"/>
      </value-group>
      <value-group name="FFLTMODE__CTLFLT">
        <value name="0" caption="No Fault Injected" value="0"/>
        <value name="1" caption="Inject a Fault on to the associated ECC/Parity Control bits (CTL[n])" value="1"/>
      </value-group>
      <value-group name="FFLTMODE__FLTMD">
        <value name="DISABLE" caption="Fault Injection Disabled" value="0"/>
        <value name="CAPT" caption="Fault Capture Mode Enabled - Captures the address (in FLTADR) and Syndrome in (FLTSYN)" value="2"/>
        <value name="SINGLEREAD" caption="Single Fault Injection (at bit selected by FLT1PTR) for Reads" value="4"/>
        <value name="DOUBLEREAD" caption="Double Fault Injection for Reads" value="5"/>
        <value name="SINGLEWRITE" caption="Single Fault Injection (at bit selected by FLT1PTR) for Writes" value="6"/>
        <value name="DOUBLEWRITE" caption="Double Fault Injection for Writes" value="7"/>
      </value-group>
      <value-group name="FFLTSYN__DEDSYN">
        <value name="0" caption="Calculated Overall Parity Concurs with Read Overall Parity" value="0"/>
        <value name="1" caption="Calculated Overall Parity Differs from Read Overall Parity" value="1"/>
      </value-group>
      <value-group name="FFLTSYN__DSERR">
        <value name="NONE" caption="No Errors" value="0"/>
        <value name="SINGLE" caption="Single Error Corrected" value="1"/>
        <value name="DOUBLE_10" caption="Double Error Detected" value="2"/>
        <value name="DOUBLE_11" caption="Double Error Detected" value="3"/>
      </value-group>
      <value-group name="FFLTSYN__CERR">
        <value name="NONE" caption="No Control bit Error (ECCSTAT either 111 or 000)" value="0"/>
        <value name="SINGLE" caption="Single Control Bit Error" value="1"/>
      </value-group>
      <value-group name="FFLTSYN__CTLSTAT">
        <value name="USEDECC_0" caption="Calculation used ECC (i.e. programming used quad write)" value="0"/>
        <value name="USEDECC_1" caption="Calculation used ECC (i.e. programming used quad write)" value="1"/>
        <value name="USEDECC_10" caption="Calculation used ECC (i.e. programming used quad write)" value="2"/>
        <value name="USEDPARITY_11" caption="Calculation used Parity (i.e. programming used single write)" value="3"/>
        <value name="USEDECC_100" caption="Calculation used ECC (i.e. programming used quad write)" value="4"/>
        <value name="USEDPARITY_101" caption="Calculation used Parity (i.e. programming used single write)" value="5"/>
        <value name="USEDPARITY_110" caption="Calculation used Parity (i.e. programming used single write)" value="6"/>
        <value name="USEDPARITY_111" caption="Calculation used Parity (i.e. programming used single write)" value="7"/>
      </value-group>
