zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
            <register name="KEYVAL_PRG_PG2" offset="0x4E8" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_PRG_PG2" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_PRG_PG3" offset="0x4EC" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_PRG_PG3" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_PRG_PG4" offset="0x4F0" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_PRG_PG4" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_PRG_PG5" offset="0x4F4" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_PRG_PG5" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_PRG_PG6" offset="0x4F8" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_PRG_PG6" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_PRG_PG7" offset="0x4FC" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_PRG_PG7" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL1_0" offset="0x500" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL1_0" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL1_1" offset="0x504" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL1_1" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL1_2" offset="0x508" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL1_2" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL1_3" offset="0x50C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL1_3" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL1_4" offset="0x510" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL1_4" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL1_5" offset="0x514" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL1_5" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL1_6" offset="0x518" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL1_6" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL1_7" offset="0x51C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL1_7" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL0_0" offset="0x520" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL0_0" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL0_1" offset="0x524" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL0_1" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL0_2" offset="0x528" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL0_2" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL0_3" offset="0x52C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL0_3" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL0_4" offset="0x530" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL0_4" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL0_5" offset="0x534" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL0_5" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL0_6" offset="0x538" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL0_6" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_SDAL0_7" offset="0x53C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_SDAL0_7" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_DAL_EL0" offset="0x540" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_DAL_EL0" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_DAL_EL1" offset="0x544" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_DAL_EL1" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_DAL_EL2" offset="0x548" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_DAL_EL2" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_DAL_EL3" offset="0x54C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_DAL_EL3" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_DAL_EL4" offset="0x550" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_DAL_EL4" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_DAL_EL5" offset="0x554" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_DAL_EL5" caption="" mask="0xFFFFFFFF"/>
            </register>
