zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
      <value-group name="XOSCCTRLA__CFDPRESC">
        <value name="DIV1" caption="48 MHz" value="0"/>
        <value name="DIV2" caption="24 MHz" value="1"/>
        <value name="DIV4" caption="12 MHz" value="2"/>
        <value name="DIV8" caption="6 MHz" value="3"/>
        <value name="DIV16" caption="3 MHz" value="4"/>
        <value name="DIV32" caption="1.5 MHz" value="5"/>
        <value name="DIV64" caption="0.75 MHz" value="6"/>
        <value name="DIV128" caption="0.375 MHz" value="7"/>
        <value name="DIV256" caption="187.5 KHz" value="8"/>
        <value name="DIV512" caption="93.75 KHz" value="9"/>
        <value name="DIV1024" caption="46.875 KHz" value="10"/>
        <value name="DIV2048" caption="23.437 KHz" value="11"/>
        <value name="DIV4096" caption="11.718 KHz" value="12"/>
        <value name="DIV8192" caption="5.85 KHz" value="13"/>
        <value name="DIV16384" caption="2.92 KHz" value="14"/>
        <value name="DIV32768" caption="1.46 KHz" value="15"/>
      </value-group>
      <value-group name="XOSCCTRLA__USBHSDIV">
        <value name="DIS" caption="USBHS PLL reference XOSC clock is disabled" value="0"/>
        <value name="DIV1" caption="USBHS PLL reference XOSC clock is divided by 1" value="1"/>
        <value name="DIV2" caption="USBHS PLL reference XOSC clock is divided by 2" value="2"/>
        <value name="DIV4" caption="USBHS PLL reference XOSC clock is divided by 4" value="3"/>
      </value-group>
      <value-group name="PLL0CTRL__REFSEL">
        <value name="GCLK" caption="Dedicated GCLK clock reference" value="0x0"/>
        <value name="XOSC" caption="XOSC clock reference" value="0x1"/>
        <value name="DFLL48M" caption="DFLL48M clock reference" value="0x2"/>
      </value-group>
      <value-group name="PLL0CTRL__BWSEL">
        <value name="BWSEL0" caption="TBD" value="0x0"/>
        <value name="BWSEL1" caption="TBD" value="0x1"/>
        <value name="BWSEL2" caption="TBD" value="0x2"/>
        <value name="BWSEL3" caption="TBD" value="0x3"/>
        <value name="BWSEL4" caption="TBD" value="0x4"/>
        <value name="BWSEL5" caption="TBD" value="0x5"/>
        <value name="BWSEL6" caption="TBD" value="0x6"/>
        <value name="BWSEL7" caption="TBD" value="0x7"/>
      </value-group>
    </module>
    <module name="PAC" id="04298" name2="sec_pac_apb_v1" version="1a0" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A Register">
          <bitfield name="PRIV" caption="Privileged Access Only" mask="0x4" values="CTRLA__PRIV"/>
        </register>
        <register name="WRCTRL" offset="0x4" rw="W" size="4" initval="0x00000000" caption="Write Control Register">
          <bitfield name="PERID" caption="Peripheral Identifier" mask="0xFF"/>
          <bitfield name="KEY" caption="Peripheral Access Control Key" mask="0xFF0000" values="WRCTRL__KEY"/>
        </register>
        <register name="STATUS" offset="0x40" rw="R" size="4" count="4" initval="0x00000000" caption="Peripheral Status n Register">
          <bitfield name="PERID0" caption="PERID Write Protection Status" mask="0x1" values="STATUS__PERID"/>
          <bitfield name="PERID1" caption="PERID Write Protection Status" mask="0x2" values="STATUS__PERID"/>
          <bitfield name="PERID2" caption="PERID Write Protection Status" mask="0x4" values="STATUS__PERID"/>
          <bitfield name="PERID3" caption="PERID Write Protection Status" mask="0x8" values="STATUS__PERID"/>
          <bitfield name="PERID4" caption="PERID Write Protection Status" mask="0x10" values="STATUS__PERID"/>
          <bitfield name="PERID5" caption="PERID Write Protection Status" mask="0x20" values="STATUS__PERID"/>
          <bitfield name="PERID6" caption="PERID Write Protection Status" mask="0x40" values="STATUS__PERID"/>
          <bitfield name="PERID7" caption="PERID Write Protection Status" mask="0x80" values="STATUS__PERID"/>
          <bitfield name="PERID8" caption="PERID Write Protection Status" mask="0x100" values="STATUS__PERID"/>
          <bitfield name="PERID9" caption="PERID Write Protection Status" mask="0x200" values="STATUS__PERID"/>
          <bitfield name="PERID10" caption="PERID Write Protection Status" mask="0x400" values="STATUS__PERID"/>
          <bitfield name="PERID11" caption="PERID Write Protection Status" mask="0x800" values="STATUS__PERID"/>
          <bitfield name="PERID12" caption="PERID Write Protection Status" mask="0x1000" values="STATUS__PERID"/>
          <bitfield name="PERID13" caption="PERID Write Protection Status" mask="0x2000" values="STATUS__PERID"/>
          <bitfield name="PERID14" caption="PERID Write Protection Status" mask="0x4000" values="STATUS__PERID"/>
          <bitfield name="PERID15" caption="PERID Write Protection Status" mask="0x8000" values="STATUS__PERID"/>
          <bitfield name="PERID16" caption="PERID Write Protection Status" mask="0x10000" values="STATUS__PERID"/>
          <bitfield name="PERID17" caption="PERID Write Protection Status" mask="0x20000" values="STATUS__PERID"/>
          <bitfield name="PERID18" caption="PERID Write Protection Status" mask="0x40000" values="STATUS__PERID"/>
          <bitfield name="PERID19" caption="PERID Write Protection Status" mask="0x80000" values="STATUS__PERID"/>
          <bitfield name="PERID20" caption="PERID Write Protection Status" mask="0x100000" values="STATUS__PERID"/>
          <bitfield name="PERID21" caption="PERID Write Protection Status" mask="0x200000" values="STATUS__PERID"/>
          <bitfield name="PERID22" caption="PERID Write Protection Status" mask="0x400000" values="STATUS__PERID"/>
          <bitfield name="PERID23" caption="PERID Write Protection Status" mask="0x800000" values="STATUS__PERID"/>
          <bitfield name="PERID24" caption="PERID Write Protection Status" mask="0x1000000" values="STATUS__PERID"/>
          <bitfield name="PERID25" caption="PERID Write Protection Status" mask="0x2000000" values="STATUS__PERID"/>
          <bitfield name="PERID26" caption="PERID Write Protection Status" mask="0x4000000" values="STATUS__PERID"/>
          <bitfield name="PERID27" caption="PERID Write Protection Status" mask="0x8000000" values="STATUS__PERID"/>
          <bitfield name="PERID28" caption="PERID Write Protection Status" mask="0x10000000" values="STATUS__PERID"/>
          <bitfield name="PERID29" caption="PERID Write Protection Status" mask="0x20000000" values="STATUS__PERID"/>
          <bitfield name="PERID30" caption="PERID Write Protection Status" mask="0x40000000" values="STATUS__PERID"/>
          <bitfield name="PERID31" caption="PERID Write Protection Status" mask="0x80000000" values="STATUS__PERID"/>
        </register>
        <register name="LOCK" offset="0x50" rw="R" size="4" count="4" initval="0x00000000" caption="Peripheral Lock n Register">
          <bitfield name="PERID0" caption="PERID Write Protection Lock Status" mask="0x1" values="LOCK__PERID"/>
          <bitfield name="PERID1" caption="PERID Write Protection Lock Status" mask="0x2" values="LOCK__PERID"/>
          <bitfield name="PERID2" caption="PERID Write Protection Lock Status" mask="0x4" values="LOCK__PERID"/>
          <bitfield name="PERID3" caption="PERID Write Protection Lock Status" mask="0x8" values="LOCK__PERID"/>
          <bitfield name="PERID4" caption="PERID Write Protection Lock Status" mask="0x10" values="LOCK__PERID"/>
          <bitfield name="PERID5" caption="PERID Write Protection Lock Status" mask="0x20" values="LOCK__PERID"/>
          <bitfield name="PERID6" caption="PERID Write Protection Lock Status" mask="0x40" values="LOCK__PERID"/>
          <bitfield name="PERID7" caption="PERID Write Protection Lock Status" mask="0x80" values="LOCK__PERID"/>
          <bitfield name="PERID8" caption="PERID Write Protection Lock Status" mask="0x100" values="LOCK__PERID"/>
          <bitfield name="PERID9" caption="PERID Write Protection Lock Status" mask="0x200" values="LOCK__PERID"/>
          <bitfield name="PERID10" caption="PERID Write Protection Lock Status" mask="0x400" values="LOCK__PERID"/>
          <bitfield name="PERID11" caption="PERID Write Protection Lock Status" mask="0x800" values="LOCK__PERID"/>
          <bitfield name="PERID12" caption="PERID Write Protection Lock Status" mask="0x1000" values="LOCK__PERID"/>
          <bitfield name="PERID13" caption="PERID Write Protection Lock Status" mask="0x2000" values="LOCK__PERID"/>
          <bitfield name="PERID14" caption="PERID Write Protection Lock Status" mask="0x4000" values="LOCK__PERID"/>
          <bitfield name="PERID15" caption="PERID Write Protection Lock Status" mask="0x8000" values="LOCK__PERID"/>
          <bitfield name="PERID16" caption="PERID Write Protection Lock Status" mask="0x10000" values="LOCK__PERID"/>
          <bitfield name="PERID17" caption="PERID Write Protection Lock Status" mask="0x20000" values="LOCK__PERID"/>
          <bitfield name="PERID18" caption="PERID Write Protection Lock Status" mask="0x40000" values="LOCK__PERID"/>
          <bitfield name="PERID19" caption="PERID Write Protection Lock Status" mask="0x80000" values="LOCK__PERID"/>
          <bitfield name="PERID20" caption="PERID Write Protection Lock Status" mask="0x100000" values="LOCK__PERID"/>
          <bitfield name="PERID21" caption="PERID Write Protection Lock Status" mask="0x200000" values="LOCK__PERID"/>
          <bitfield name="PERID22" caption="PERID Write Protection Lock Status" mask="0x400000" values="LOCK__PERID"/>
          <bitfield name="PERID23" caption="PERID Write Protection Lock Status" mask="0x800000" values="LOCK__PERID"/>
          <bitfield name="PERID24" caption="PERID Write Protection Lock Status" mask="0x1000000" values="LOCK__PERID"/>
          <bitfield name="PERID25" caption="PERID Write Protection Lock Status" mask="0x2000000" values="LOCK__PERID"/>
          <bitfield name="PERID26" caption="PERID Write Protection Lock Status" mask="0x4000000" values="LOCK__PERID"/>
          <bitfield name="PERID27" caption="PERID Write Protection Lock Status" mask="0x8000000" values="LOCK__PERID"/>
          <bitfield name="PERID28" caption="PERID Write Protection Lock Status" mask="0x10000000" values="LOCK__PERID"/>
          <bitfield name="PERID29" caption="PERID Write Protection Lock Status" mask="0x20000000" values="LOCK__PERID"/>
          <bitfield name="PERID30" caption="PERID Write Protection Lock Status" mask="0x40000000" values="LOCK__PERID"/>
          <bitfield name="PERID31" caption="PERID Write Protection Lock Status" mask="0x80000000" values="LOCK__PERID"/>
        </register>
      </register-group>
      <value-group name="CTRLA__PRIV">
        <value name="DISABLE" caption="Macro register accessible in privileged and unprivileged accesses." value="0"/>
        <value name="ENABLE" caption="Macro registers only accessible in privileged accesses" value="1"/>
      </value-group>
      <value-group name="WRCTRL__KEY">
        <value name="OFF" caption="OFF - No Action" value="0"/>
        <value name="CLEAR" caption="CLEAR - Clear the peripheral write protection" value="1"/>
        <value name="SET" caption="SET - Set the peripheral write protection" value="2"/>
        <value name="LOCK" caption="LOCK - Set and Lock the write protection state of the peripheral until the next reset" value="3"/>
      </value-group>
