zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
      <value-group name="CTRLA__SWRST">
        <value name="0" caption="There is no reset operation ongoing" value="0"/>
        <value name="1" caption="The reset operation is ongoing" value="1"/>
      </value-group>
      <value-group name="CTRLA__ENABLE">
        <value name="0" caption="Disable module. System clock is only requested for bus transactions. GCLK is never requested." value="0"/>
        <value name="1" caption="Enable module by allowing both the generic clock and system clock requests based on the incoming clock requests from the SIB." value="1"/>
      </value-group>
    </module>
    <module name="RSTC" id="03926" name2="pwr_rpmu_rstc_v1" version="1c0" caption="Reset Controller">
      <register-group name="RSTC" caption="Reset Controller">
        <register name="RCAUSE" offset="0x0" rw="R" size="2" caption="Reset Cause">
          <bitfield name="POR" caption="Power On Reset" mask="0x1"/>
          <bitfield name="PORCORE" caption="Brown Out CORE Detector Reset" mask="0x2"/>
          <bitfield name="BORVDDREG" caption="Brown Out VDDREG Detector Reset" mask="0x4"/>
          <bitfield name="BORVDDA" caption="Brown Out VDDA Detector Reset" mask="0x8"/>
          <bitfield name="BORVDDIO" caption="Brown Out VDDIO Detector Reset" mask="0x10"/>
          <bitfield name="EXT" caption="External Reset" mask="0x20"/>
          <bitfield name="WDT" caption="Watchdog Reset" mask="0x40"/>
          <bitfield name="SYST" caption="System Reset Request" mask="0x80"/>
          <bitfield name="BACKUP" caption="Backup Reset" mask="0x100"/>
          <bitfield name="LOCKUP" caption="Lockup Reset" mask="0x200"/>
        </register>
        <register name="BKUPEXIT" offset="0x2" rw="R" size="1" initval="0x00" caption="Backup Exit Source. Implemented only if RSTC_BACKUP_IMPLEMENTED=1">
          <bitfield name="RTC" caption="Real Timer Counter Interrupt" mask="0x2"/>
          <bitfield name="HIB0" caption="Hibernate" mask="0x80"/>
        </register>
        <register name="DBGCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Debug Control">
          <bitfield name="LCKUPDIS" caption="Lockup Disable" mask="0x1"/>
        </register>
      </register-group>
    </module>
    <module name="RTC" id="03608" name2="tmr_rtc_u2250_v3" version="3b0" caption="Real-Time Counter">
      <register-group name="MODE2_ALARM" size="0x8">
        <mode name="MODE2" qualifier="RTC.MODE2.CTRLA.MODE" value="2" caption="Clock/Calendar with Alarm"/>
        <register modes="MODE2" name="ALARM" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="MODE2_ALARM Alarm n Value">
          <bitfield name="SECOND" caption="Second" mask="0x3F"/>
          <bitfield name="MINUTE" caption="Minute" mask="0xFC0"/>
          <bitfield name="HOUR" caption="Hour" mask="0x1F000" values="MODE2_ALARM__HOUR"/>
          <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
          <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
          <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
        </register>
        <register modes="MODE2" name="MASK" offset="0x4" rw="RW" access="WSYNC" size="1" initval="0x00" caption="MODE2_ALARM Alarm n Mask">
          <bitfield name="SEL" caption="Alarm Mask Selection" mask="0x7" values="MODE2_MASK__SEL"/>
        </register>
      </register-group>
      <register-group name="RTC" caption="Real-Time Counter">
        <mode name="MODE0" qualifier="RTC.MODE0.CTRLA.MODE" value="0" caption="32-bit Counter with Single 32-bit Compare"/>
        <mode name="MODE1" qualifier="RTC.MODE1.CTRLA.MODE" value="1" caption="16-bit Counter with Two 16-bit Compares"/>
        <mode name="MODE2" qualifier="RTC.MODE2.CTRLA.MODE" value="2" caption="Clock/Calendar with Alarm"/>
        <register modes="MODE0" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE0 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="MODE0_CTRLA__MODE"/>
          <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="MODE0_CTRLA__PRESCALER"/>
          <bitfield name="GPTRST" caption="GP Registers Reset On Tamper Enable" mask="0x4000"/>
          <bitfield name="COUNTSYNC" caption="Count Read Synchronization Enable" mask="0x8000"/>
        </register>
        <register modes="MODE1" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE1 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="MODE1_CTRLA__MODE"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="MODE1_CTRLA__PRESCALER"/>
          <bitfield name="GPTRST" caption="GP Registers Reset On Tamper Enable" mask="0x4000"/>
          <bitfield name="COUNTSYNC" caption="Count Read Synchronization Enable" mask="0x8000"/>
        </register>
        <register modes="MODE2" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE2 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="MODE2_CTRLA__MODE"/>
          <bitfield name="CLKREP" caption="Clock Representation" mask="0x40"/>
          <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="MODE2_CTRLA__PRESCALER"/>
          <bitfield name="GPTRST" caption="GP Registers Reset On Tamper Enable" mask="0x4000"/>
          <bitfield name="CLOCKSYNC" caption="Clock Read Synchronization Enable" mask="0x8000"/>
        </register>
