zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00048.atdf
      <value-group name="USART_CTRLB__ENC">
        <value name="DISABLE" caption="Data is not encoded" value="0x0"/>
        <value name="IRDA" caption="Data is IrDA encoded" value="0x1"/>
      </value-group>
      <value-group name="USART_CTRLB__PMODE">
        <value name="EVEN" caption="Even parity" value="0x0"/>
        <value name="ODD" caption="Odd parity" value="0x1"/>
      </value-group>
      <value-group name="USART_CTRLB__FIFOCLR">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="TXFIFO" caption="Clear TX FIFO" value="0x1"/>
        <value name="RXFIFO" caption="Clear RX FIFO" value="0x2"/>
        <value name="BOTH" caption="Clear both TX and RF FIFOs" value="0x3"/>
      </value-group>
      <value-group name="USART_CTRLB__LINCMD">
        <value name="NONE" caption="Normal USART transmission" value="0x0"/>
        <value name="SOFTWARE_CONTROL_TRANSMIT_CMD" caption="Break field is transmitted when DATA is written" value="0x1"/>
        <value name="AUTO_TRANSMIT_CMD" caption="Break, synch and identifier are automaticcaly transmitted when DATA is written with the identifier" value="0x2"/>
      </value-group>
      <value-group name="I2CM_CTRLC__RXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated when DATA is present in the FIFO" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when FIFO is half-full" value="0x1"/>
        <value name="FULL" caption="Interrupt and DMA triggers are generated when FIFO is full" value="0x2"/>
      </value-group>
      <value-group name="I2CM_CTRLC__TXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when half FIFO space is free" value="0x1"/>
        <value name="EMPTY" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x2"/>
      </value-group>
      <value-group name="I2CS_CTRLC__RXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated when DATA is present in the FIFO" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when FIFO is half-full" value="0x1"/>
        <value name="FULL" caption="Interrupt and DMA triggers are generated when FIFO is full" value="0x2"/>
      </value-group>
      <value-group name="I2CS_CTRLC__TXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when half FIFO space is free" value="0x1"/>
        <value name="EMPTY" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x2"/>
      </value-group>
      <value-group name="SPI_CTRLC__FSLEN">
        <value name="STROBE" caption="One SCK pulse" value="0x0"/>
        <value name="LEVEL" caption="One frame duration" value="0x1"/>
      </value-group>
      <value-group name="SPI_CTRLC__FSPOL">
        <value name="HIGH" caption="VCC-level valid polarity" value="0x0"/>
        <value name="LOW" caption="GND-level valid polarity" value="0x1"/>
      </value-group>
      <value-group name="SPI_CTRLC__FMODE">
        <value name="MASTER" caption="Frame Master" value="0x0"/>
        <value name="SLAVE" caption="Frame Slave" value="0x1"/>
      </value-group>
      <value-group name="SPI_CTRLC__RXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated when DATA is present in the FIFO" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when FIFO is half-full" value="0x1"/>
        <value name="FULL" caption="Interrupt and DMA triggers are generated when FIFO is full" value="0x2"/>
      </value-group>
      <value-group name="SPI_CTRLC__TXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when half FIFO space is free" value="0x1"/>
        <value name="EMPTY" caption="Interrupt and DMA triggers are generated as long as the FIFO is empty" value="0x2"/>
      </value-group>
      <value-group name="USART_CTRLC__BRKLEN">
        <value name="13BITS" caption="Break field transmission is 13 bit times" value="0x0"/>
        <value name="17BITS" caption="Break field transmission is 17 bit times" value="0x1"/>
        <value name="21BITS" caption="Break field transmission is 21 bit times" value="0x2"/>
        <value name="26BITS" caption="Break field transmission is 26 bit times" value="0x3"/>
      </value-group>
      <value-group name="USART_CTRLC__HDRDLY">
        <value name="1BIT" caption="Delay between break and sync transmission is 1-bit time" value="0x0"/>
        <value name="4BITS" caption="Delay between break and sync transmission is 4-bit time" value="0x1"/>
        <value name="8BITS" caption="Delay between break and sync transmission is 8-bit time" value="0x2"/>
        <value name="14BITS" caption="Delay between break and sync transmission is 14-bit time" value="0x3"/>
      </value-group>
      <value-group name="USART_CTRLC__RXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated when DATA is present in the FIFO" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when FIFO is half-full" value="0x1"/>
        <value name="FULL" caption="Interrupt and DMA triggers are generated when FIFO is full" value="0x2"/>
      </value-group>
      <value-group name="USART_CTRLC__TXTRHOLD">
        <value name="DEFAULT" caption="Interrupt and DMA triggers are generated as long as the FIFO is not full" value="0x0"/>
        <value name="HALF" caption="Interrupt and DMA triggers are generated when half FIFO space is free" value="0x1"/>
        <value name="EMPTY" caption="Interrupt and DMA triggers are generated when the FIFO is empty" value="0x2"/>
      </value-group>
      <value-group name="USART_LENGTH__LENEN">
        <value name="DISABLE" caption="Length counter is disabled" value="0x0"/>
        <value name="TX" caption="Length counter is enabled for transmit" value="0x1"/>
        <value name="RX" caption="Length counter is enabled for receive" value="0x2"/>
      </value-group>
    </module>
    <module name="SUPC" id="03926" name2="pwr_rpmu_supc_v1" version="1c0" caption="Supply Controller">
      <register-group name="SUPC" caption="Supply Controller">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="LVDET" caption="Low Voltage Detector Interrupt Enable" mask="0x1"/>
          <bitfield name="LVDRDY" caption="Low Voltage Detector Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="ULDORDY" caption="User LDO Regulator Ready Interrupt Enable" mask="0x4"/>
          <bitfield name="ULDOOVHEAT" caption="User LDO Regulator OverHeat Interrupt Enable" mask="0x8"/>
          <bitfield name="BORVDDUSB" caption="BORVDDUSB Interrupt Enable" mask="0x20"/>
          <bitfield name="ADDVREGRDY0" caption="Additional Regulator ready 0 Interrupt Enable" mask="0x100"/>
        </register>
